<?xml version="1.0"?>
<TEI xmlns="http://www.tei-c.org/ns/1.0" xmlns:xi="http://www.w3.org/2001/XInclude">
  <teiHeader>
    <fileDesc>
      <titleStmt>
        <title>Une initiation &#xE0; la TEI</title>
        <author>Lou Burnard Consulting</author>
      </titleStmt>
      <publicationStmt>
        <publisher>TEI</publisher>
        <availability>
          <p>Freely available for use and derivative works under a
          Creative Commons Attribution Non-Commercial license.</p>
        </availability>
        <date>septembre 2015</date>
      </publicationStmt>
      <sourceDesc>
	<p/>
      </sourceDesc>
    </fileDesc>
  </teiHeader>
  <text>
      <body>
	<divGen type="toc"/>
<?tex \newpage ?>
<div>
        <head>&#xC0; la d&#xE9;couverte d'oXygen</head>
<p xmlns="http://www.tei-c.org/ns/1.0">Dans ce premier exercice, nous allons nous servir d'oXygen pour : <list>
            <item>la cr&#xE9;ation d'un nouveau document XML</item>
            <item>le balisage progressif d'un document</item>
            <item>la validation continuelle d'un document</item>
            <item>l'affichage du document sans balise</item>
          </list>
        </p><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Cr&#xE9;ation d'un document n&#xE9;-num&#xE9;rique</head>
        <p>La TEI ne sert pas uniquement &#xE0; l'encodage des documents anciens, d&#xE9;j&#xE0; existants sur
          papier ou pierre. Elle sert aussi &#xE0; la cr&#xE9;ation de documents nouveaux <foreign>ex
            nihilo</foreign>.</p>
     
        <list>
          <item>D&#xE9;marrez oXygen.</item>
          <item>Cliquez sur l'ic&#xF4;ne Nouveau en haut &#xE0; gauche (ou s&#xE9;lectionnez Nouveau du menu
            Fichier, ou tapez CTRL-N) pour ouvrir la bo&#xEE;te de dialogue Nouveau</item>
          <item>Choisissez <ident>Cadre des mod&#xE8;les</ident>, ensuite <ident>TEI P5</ident>, puis
              <ident>Bare</ident>, pour s&#xE9;lectionner un sch&#xE9;ma TEI minimal. </item>
          <item>
            <graphic height="5cm" url="../Graphics/new-bare-1.png"/>
          </item>
          <item> Cliquez sur le bouton <ident>Cr&#xE9;er</ident> en bas. oXygen affiche un document TEI
            minimal que vous allez compl&#xE9;ter.</item>
        </list>
        <p>Le sch&#xE9;ma TEI bare contient un minimum de balises, mais il permet quand-m&#xEA;me de d&#xE9;crire
          un document complet TEI. </p>
        <p>On est maintenant dans l'espace de travail typique d'oXygen. Par d&#xE9;faut, il y a plusieurs
          petites fen&#xEA;tres, autour d'une grande blanche o&#xF9; nous allons &#xE9;diter notre document. A
          gauche, par exemple, vous voyez dans la fen&#xEA;tre <ident>Sommaire</ident> un aper&#xE7;u de la
          structure du document. </p>
        <p>Notez qu'un document TEI est divis&#xE9; en deux parties. En haut, vous avez les m&#xE9;tadonn&#xE9;es,
          entour&#xE9;es de la balise <gi>teiHeader</gi>. En bas se trouve le texte, entour&#xE9; de la balise
            <gi>text</gi>. </p>
        <p>
          <graphic height="5cm" url="../Graphics/nouveau-bare-2.png"/>
        </p>
        <p>En bas de l'&#xE9;cran, vous voyez qu'il est possible de modifier l'affichage du document en
          cliquant sur les boutons <term>Texte</term>, <term>Grille</term>, ou <term>Auteur</term>.
          Nous, on n'a pas peur des balises, donc on va commencer &#xE0; l'&#xE9;diter en mode
            <term>Texte</term>. </p>
        <p>D'abord, on va fournir les m&#xE9;tadonn&#xE9;es essentielles &#xE0; tout nouveau document : son titre,
          sa diffusion, et ses origines. oXygen vous propose des morceaux de texte qu'il faut
          changer puis compl&#xE9;ter... <list>
            <item>Remplacez le mot <q>Title</q> (entre les balises <gi>title</gi> et
                <tag>/title</tag>) par un titre pour votre document. &#xC0; vous de choisir ! Quelque
              chose comme "&#xC0; la d&#xE9;couverte d'oXygen" suffirait. </item>
            <item>Remplacez les deux autres morceaux de texte propos&#xE9;s par des mentions plus
              appropri&#xE9;es. Par exemple, pour publication, on pourrait mettre <q>Brouillon in&#xE9;dit</q>
              ou <q>Distribu&#xE9; sur mon blog</q> ; pour <gi>sourceDesc</gi>, on vous propose <q>&#x152;uvre
                originale, guid&#xE9;e par une formation TEI</q>.</item>
          </list>
        </p>
        <p>oXygen par d&#xE9;faut cherchera &#xE0; maintenir votre document dans un &#xE9;tat de validit&#xE9;.
          Qu'est-ce qui arrive si vous l'endommagez ? <list>
            <item>Effacez quelques lettres &#xE0; l'int&#xE9;rieur de n'importe quelle balise : par exemple
              changez <gi>publicationStmt</gi> en <gi>publicat</gi>. </item>
            <item>oXygen fait de son mieux. D'abord, il change la balise fermante correspondante
              (qui devient instantan&#xE9;ment <code>&lt;/publicat&gt;</code>): le document reste donc
              bien form&#xE9;. Mais il n'est plus valide : par cons&#xE9;quent les balises fautives sont
              soulign&#xE9;es en rouge ; il y a un message d'erreur en bas de l'&#xE9;cran ; et &#xE0; droite il y
              a quelques taches rouges.</item>
            <item>Cliquez sur les taches rouges pour essayer de comprendre la mani&#xE8;re dont une
              erreur peut en encha&#xEE;ner une autre.</item>
            <item>Cliquez sur CTRL-Z (ou s&#xE9;lectionnez <ident>Undo</ident> du menu
                <ident>Edit</ident>) pour revenir dans un &#xE9;tat de gr&#xE2;ce... vous verrez que le petit
              carreau rouge en haut &#xE0; droite devient vert apr&#xE8;s correction de toutes les
              erreurs.</item>
          </list>
        </p>
        <p>En plus, oXygen ne vous permettra d'ajouter que des balises pr&#xE9;vues dans le sch&#xE9;ma
          actuellement s&#xE9;lectionn&#xE9; pour le document. <list>
            <item>Mettez le curseur &#xE0; la fin de la 7&#xE8;me ou au d&#xE9;but de la 8&#xE8;me ligne, entre
                <code>&lt;/title&gt;</code> et <code>&lt;/titleSmt&gt;</code>;</item>
            <item>tapez <code>&lt;</code> et arr&#xEA;tez un instant ;</item>
            <item>le carreau vert redevient rouge, parce que vous n'avez pas encore entr&#xE9; le nom de
              l'&#xE9;l&#xE9;ment souhait&#xE9;.</item>
            <item>oXygen vous propose une liste de balises disponibles &#xE0; cet emplacement dans le
              document : notamment vous avez le droit d'ins&#xE9;rer ici un &#xE9;l&#xE9;ment <gi>author</gi> ou
              encore un <gi>title</gi>, de terminer le <gi>titleStmt</gi>, d'ins&#xE9;rer un commentaire
              XML etc. </item>
            <item>Tapez sur ENTRER pour accepter la premi&#xE8;re proposition. oXygen ins&#xE8;re dans votre
              document les balises <gi>author</gi> et <code>&lt;/author&gt;</code>.</item>
            <item>Le curseur reste &#xE0; l'int&#xE9;rieur de la balise ouvrante, au cas o&#xF9; vous d&#xE9;sireriez
              sp&#xE9;cifier ses attributs. Faites bouger le curseur d'un caract&#xE8;re vers la droite et tapez
              votre nom, comme auteur du fichier.</item>
          </list>
        </p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Ajout de texte au document</head>
        <p>Enfin, nous sommes pr&#xEA;ts ... commencez la cr&#xE9;ation de votre document. &#xC0; vous de d&#xE9;cider
          de son contenu et de son balisage. </p>
        <p>D'abord, quels composants proposeriez-vous pour votre document ? Un document contenant un
          seul paragraphe n'est gu&#xE8;re probable ! Avec le sch&#xE9;ma <term>bare</term> vous avez le droit
          de signaler : <list>
            <item>des titres ... &#xE0; baliser avec la balise <gi>head</gi></item>
            <item>des chapitres ... &#xE0; baliser avec la balise <gi>div</gi></item>
            <item>des listes ... &#xE0; baliser avec la balise <gi>list</gi></item>
            <item>des paragraphes ... &#xE0; baliser avec la balise <gi>p</gi></item>
          </list> Allons-y !</p>
        <p>Dans le reste de ce petit tutoriel, nous allons vous montrer quelques manipulations
          utiles offertes par ce logiciel. </p>
        <p>D'abord, une question importante. Pour le contenu, OK, il faut le cr&#xE9;er -- mais est-ce
          qu'il faut toujours taper soi-m&#xEA;me les balises ? Non : oXygen est l&#xE0; pour vous aider. Vous
          avez d&#xE9;j&#xE0; vu comment il peut vous proposer la liste des balises disponibles &#xE0; un certain
          emplacement du document. Il peut aussi vous sugg&#xE9;rer comment baliser un morceau de texte
          s&#xE9;lectionn&#xE9;. </p>
        <list>
          <item>Avec la souris, s&#xE9;lectionnez le contenu du <gi>body</gi>, i.e. la s&#xE9;quence
              <code>&lt;p&gt;Some text here&lt;/p&gt;</code>. </item>
          <item>Tapez CTRL-E (ou s&#xE9;lectionnez <ident>XML Refactoring</ident> et ensuite
              <ident>Entourer des balises</ident> dans le menu <ident>Document</ident>.</item>
          <item>oXygen vous propose toutes les balises qui pourraient &#xE9;ventuellement &#xEA;tre ins&#xE9;r&#xE9;es &#xE0;
            cet endroit pr&#xE9;cis du document : dans ce cas, il est conseill&#xE9; de s&#xE9;lectionner
              <gi>div</gi>. Puis, cliquez sur <ident>Accepter</ident></item>
          <item>L'&#xE9;l&#xE9;ment <gi>div</gi> va contenir le premier chapitre de votre document. Ins&#xE9;rez
            donc un titre au d&#xE9;but de ce <gi>div</gi>, en vous servant de la balise <gi>head</gi>
          </item>
          <item>Il serait aussi utile de num&#xE9;roter vos chapitres d'une mani&#xE8;re explicite : pour
            cela, on vous propose l'attribut <att>n</att> qui est disponible sur n'importe quel
            &#xE9;l&#xE9;ment TEI, y compris <gi>div</gi>. </item>
          <item>Mettez le curseur <emph>&#xE0; l'int&#xE9;rieur</emph> de la balise <gi>div</gi> juste avant
            le &gt; et tapez un seul espace. oXygen vous propose un menu des attributs disponibles. </item>
          <item>Tapez sur RETOUR pour s&#xE9;lectionnez <att>n</att>. oXygen vous informe qu'il faut dans
            ce cas ajouter une valeur, et le curseur reste entre les guillemets.</item>
          <item>Tapez (par exemple) <code>1</code>, et votre document redeviendra valide. </item>
        </list>
        <p>Votre document devrait maintenant ressembler &#xE0; ceci :</p>
        <p>
          <graphic height="4cm" url="../Graphics/body-shot.png"/>
        </p>
        <p>&#xC0; vous d'ajouter maintenant du texte &#xE0; ce paragraphe : un peu plus int&#xE9;ressant que
            <q>some text here</q> de pr&#xE9;f&#xE9;rence ! D&#xE9;crivez-nous vos premi&#xE8;res r&#xE9;actions avec oXygen
          ; partagez vos id&#xE9;es sur la situation politique actuelle ; &#xE9;crivez ce que vous voulez.</p>
        <p>Sans doute aurez-vous besoin de plus d'un seul paragraphe. Comment faire pour terminer
          celui-ci et commencer un nouveau ? Bien-s&#xFB;r on peut simplement taper les balises
            <code>&lt;/p&gt;&lt;p&gt;</code> mais il y a une autre mani&#xE8;re plus simple. </p>
      
        <p>Supposons que vous avez maintenant quelques centaines de mots dans votre seul paragraphe,
          et que vous voulez le diviser en plusieurs.</p>
        <list>
          <item>Mettez le curseur au point de chaque division souhait&#xE9;e </item>
          <item>Tapez ALT + MAJ + D ou s&#xE9;lectionnez <ident>XML Refactoring</ident> et ensuite
              <ident>&#xC9;l&#xE9;ment de division</ident> (sic) dans le menu <ident>Document</ident>.</item>
        </list>
        <p>Vous pouvez faire pareil pour diviser le chapitre unique, mais attention &#xE0; choisir un
          endroit valide pour effectuer la division : <emph>entre</emph> deux &#xE9;l&#xE9;ments <gi>p</gi>,
          et non pas dans l'enceinte d'un <gi>p</gi>. </p>
        <p>Dans un de vos chapitres, n'omettez pas d'ajouter une liste, balis&#xE9;e avec un &#xE9;l&#xE9;ment
            <gi>list</gi>, contenant une s&#xE9;quence de <gi>item</gi> &#xE9;l&#xE9;ments, pr&#xE9;c&#xE9;d&#xE9;e d'un
            <gi>head</gi> facultatif.</p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>L'affichage du texte balis&#xE9;</head>
        <p>Est-ce que la quantit&#xE9; de balises dans votre document commence &#xE0; vous inqui&#xE9;ter un peu ? </p>
        <p>On peut mettre en ordre le balisage que l'on a fait, en cliquant sur le bouton
          d'indentation, ou en tapant CTRL+MAJ+P, ou en s&#xE9;lectionnant Source-&gt;Indenter le document
          sur le menu Document. Mais peut &#xEA;tre pr&#xE9;f&#xE9;reriez-vous voir dispara&#xEE;tre les balises ?</p>
        <list>
          <item>Au fond de la fen&#xEA;tre vous voyez trois onglets: Texte , Grille, et Auteur.
            S&#xE9;lectionnez le dernier. L'affichage de votre document change, et un nouveau menu
              <ident>TEI P5</ident> devient disponible. Sur ce menu, s&#xE9;lectionnez <ident>Mode
              d'affichage</ident> des balises et regardez les possibilit&#xE9;s offertes par ces options. </item>
          <item>L'option <ident>Toutes les balises</ident> affiche les balises en ic&#xF4;nes; l'option
              <ident>Aucune balise</ident> les fait dispara&#xEE;tre totalement.</item>
          <item> Notez en plus que votre document est maintenant stylis&#xE9; ; il y a des changements de
            police ; les retours de ligne sont trait&#xE9;s comme des blancs ; etc. </item>
          <item>Dans l3 mode auteur, on peut diviser un &#xE9;l&#xE9;ment simplement en tapant RETOUR deux fois.
            Essayez cela.</item>
        </list>
        <p>Plus tard, nous verrons comment vous pourrez contr&#xF4;ler l'affichage de votre document avec
          une <term>feuille de style</term>.</p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Importation d'un document bureautique</head>
        <p>La plupart des documents num&#xE9;riques que vous rencontrerez dans le monde actuel semble
          innocent de toute balise XML. Par exemple, les documents pr&#xE9;par&#xE9;s &#xE0; l'aide des outils
          bureautiques tels Microsoft Word ou Open Office donnent l'apparence d'&#xEA;tre du texte brut. Mais
          effectivement, ce n'est qu'une apparence : derri&#xE8;re tout cela il existe un format XML, que
          l'on peut manipuler, et donc qu'on peut transformer dans un format XML TEI. </p>
        <p>Dans votre dossier Travaux il y a un fichier <ident>lacigale.docx</ident> : cliquez
          l&#xE0;-dessus pour l'ouvrir. Sans doute vous le reconnaitrez. On va se servir d'oXygen pour le
          transformer en XML TEI.</p>
        <p>Un fichier Word docx est une archive comprim&#xE9;e qui contient plusieurs autres fichiers, y
          compris des fichiers XML qu'on peut g&#xE9;rer et transformer avec oXygen comme n'importe quel
          autre fichier XML. La conversion prend en compte les styles Word existant dans le
          fichier, et donc peut &#xEA;tre personnalis&#xE9;e.</p>
        <list>
          <item>Chargez oXygen. S&#xE9;lectionnez Ouvrir dans le menu Fichier (ou tapez CTRL-O, ou
            cliquez l'ic&#xF4;ne dossier) et s&#xE9;lectionnez le fichier <ident>lacigale.docx</ident> dans
            votre dossier <ident>Travaux</ident> .</item>
          <item>Une fen&#xEA;tre intitul&#xE9;e <ident>Navigateur d'Archives</ident> s'ouvre &#xE0; gauche de
            l'&#xE9;cran principal. La structure de l'archive docx y est affich&#xE9;e.</item>
          <item><graphic url="../Graphics/navigateur-1.png" height="4cm"/></item>
          <item>Cliquez sur la petite clef bleue &#xE0; c&#xF4;t&#xE9; du dossier <ident>word</ident> pour voir ce
            qu'il contient</item>
          <item><graphic url="../Graphics/navigateur-2.png" height="4cm"/></item>
          <item>S&#xE9;lectionnez le fichier <ident>document.xml</ident> et double-cliquez pour
            l'ouvrir (peut prendre un peu de temps si le fichier est grand) </item>
          <!--<item><graphic url="document-word.png"/></item-->
          <item>Voil&#xE0; : c'est un document XML, plein de balises, pour la plupart appartenant &#xE0; un
            espace de noms d&#xE9;finie par Microsoft. Convertissons-le !</item>
        </list>
        <list>
          <item>Avec ce fichier <ident>document.xml</ident> ouvert dans l'&#xE9;cran principal,
            s&#xE9;lectionnez <ident>Transformation -&gt; Configurer les Sc&#xE9;nario(s) de
              Transformation</ident> du menu <ident>Document</ident>. Ou tapez
              <code>CTRL-MAJ-C</code>. Ou cliquez sur la petit icone clef &#xE0; molette (celui-ci :
              <graphic url="../Graphics/spanner.png" height="7mm"/>) </item>
          <item>oXygen vous pr&#xE9;sente les options de transformations disponibles pour ce document,
            parmi lesquelles une transformation nomm&#xE9;e DOCX TEI P5 devrait figurer. </item>
          <item><graphic url="../Graphics/configurer-1.png" height="7cm"/></item>
          <item>Cochez la case &#xE0; c&#xF4;t&#xE9; et cliquez sur le bouton <ident>Appliquer associ&#xE9;s</ident> au
            dessous. Une nouvelle fen&#xEA;tre s'ouvre en bas pour l'affichage des messages concernant le
            processus de transformation: vous pouvez les ignorer sans probl&#xE8;me.</item>
          <item>Dans l'&#xE9;cran principal, un document TEI-conforme s'affiche. S&#xE9;lectionnez
              <ident>Source -&gt; Format and Indent</ident> du menu <ident>Document</ident> menu, ou
            tapez <code>CTRL-MAJ-P</code> ou cliquez sur le bouton <ident>Indent</ident> (celui-ci :
              <graphic url="../Graphics/indent.png" height="7mm"/>) pour regarder sa structure </item>
          <!--item><graphic url="converted-1.png"/></item-->
          <item>L'attribut <att>rend</att> indique le nom du style Word utilis&#xE9; dans cette portion
            du document original. Une transformation XSLT plus complexe pourrait donc s'en servir
            pour effectuer une conversion plus intelligente.</item>
        </list>
        <p>Si vous disposez d'autres documents Word docx, n'h&#xE9;sitez pas &#xE0; essayer de les transformer
          de la m&#xEA;me mani&#xE8;re!</p>
    </div>
</div>
<?tex \newpage ?>
<div>
        <head>Analyse et mod&#xE9;lisation des textes</head>
<div xmlns="http://www.tei-c.org/ns/1.0" rend="slide">
        <head>Magritte nous rappelle</head>
        <figure>
          <graphic url="../Graphics/ceci-nest-pas-une-pipe.jpg"/>
        </figure>
        <note><p>&#xC0; chaque fois que cr&#xE9;&#xE9;e une repr&#xE9;sentation d&#x2019;un texte ou d&#x2019;autre chose, une image non r&#xE9;ductible &#xE0; la r&#xE9;alit&#xE9;.</p></note>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Num&#xE9;riser et encoder...</head>
        <p>La num&#xE9;risation nous propose une <emph>image</emph>, une repr&#xE9;sentation d'un
          object d&#xE9;j&#xE0; existant</p>
        <p>L'encodage nous permet de repr&#xE9;senter l'image des <emph>id&#xE9;es</emph>
          r&#xE9;sultant de ces repr&#xE9;sentations</p>
        <note><p>Distinction fine mais tr&#xE8;s importante.</p></note>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Des id&#xE9;es sur quoi?</head>
        <p>Tout! mais on peut distinger plusieurs axes...
          <list>
            <item>infos <q>intrins&#xE8;ques</q> &#xE0; l'objet : les formes, couleurs,
              etc. d'une image; les sons, rythmes, etc. d'une musique; les
              structures linguistiques (mot, phrase, paragraphe) ou formels (chapitre, titre, nom de lieu) d'un texte...</item>
            <item>infos <q>extrins&#xE8;ques</q> ou <q>meta</q> sur l'objet : son type,
              ses origines, ses buts, ses usages ...</item>
            <item>infos <q>interpr&#xE9;tatives</q>: la port&#xE9;e d'un texte ou d'un
              dessin, le programme d'une musique ou d'un rite...</item>
          </list>
        </p>
        <p rend="display">distinctions floues mais pervasives...</p>
        <note><p>L&#x2019;essentiel est de faire le choix. Peut distinguer des actes, des informations intrins&#xE8;ques &#xE0; un objet, etc. Des informations dite m&#xE9;ta, extrins&#xE8;ques qui ne sont pas n&#xE9;cessairement pr&#xE9;sentes dans l&#x2019;objet&#xA0;: ses origines, ses buts, etc. Enfin, des informations interpr&#xE9;tatives.</p></note>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Modelisation et structuration</head>
        <p>Il existe (quelques) m&#xE9;thodes classiques d'analyses de donn&#xE9;es. L'important c'est de
          comprendre: <list>
            <item>toute m&#xE9;thode ne serait qu'une mod&#xE9;lisation</item>
            <item>la modelisation devrait faire resortir la structuration essentielle d'un objet
              complexe</item>
          </list>
        </p>
        <p>Apr&#xE8;s une mod&#xE9;lisation, on peut donner une impl&#xE9;mentation informatis&#xE9;e&#xA0;; sans mod&#xE8;le, une
          impl&#xE9;mentation risque d&#x2019;&#xEA;tre incompr&#xE9;hensible et al&#xE9;atoire, inutile&#x2026;</p>
        <note><p>Ce que va vouloir faire, c&#x2019;est modaliser. Pourquoi conduire cette &#xE9;tape, c&#x2019;est que cela permettra de donner une impl&#xE9;mentation informatis&#xE9;e. Si vous n&#x2019;&#xEA;tes pas conscient de votre mod&#xE8;le, vous risquer d&#x2019;avoir une impl&#xE9;mentation inconsistante ou incompr&#xE9;hensible qui ne sera pas exploitable.</p></note>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Analyse des donn&#xE9;es classique</head>
        <p>On identifie&#x2026; <list>
            <item>les <soCalled>objets d&#x2019;inter&#xEA;t</soCalled></item>
            <item>leurs attributs/propri&#xE9;t&#xE9;s</item>
            <item>les relations entre objets</item>
            <item>les proc&#xE9;dures/traitements essentiels envisag&#xE9;s </item>
          </list>
        </p>
        <note><p>Dans l&#x2019;analyse de donn&#xE9;es classique, on avait l&#x2019;id&#xE9;e qu&#x2019;il serait possible de conceptualiser l&#x2019;ensemble de l&#x2019;univers d&#x2019;une entreprise. On identifie toute de suite les objets d&#x2019;int&#xE9;r&#xEA;t, leurs attributs et propri&#xE9;t&#xE9;s, etc.</p>
        <p>On peut &#xE9;galement appliquer ce mod&#xE8;le dans notre cas. Vous savez tous ce qu&#x2019;est qu&#x2019;une carte postale.</p></note>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Par exemple&#x2026;</head>
        <figure>    
          <graphic url="../Graphics/carte-modele.png"/>
        </figure>
        <note><p>On peut &#xE9;galement appliquer ce mod&#xE8;le dans notre cas. Vous savez tous ce qu&#x2019;est qu&#x2019;une carte postale.</p>
        <p>En jaune, ce sont des entit&#xE9;s, des choses pour lesquelles on dispose d&#x2019;information. Les liens sont des relations entre les objets.</p>
        <p>On a une carte et des noms de personnes. Les noms de personnes peuvent intervenir pour deux raisons&#xA0;: o&#xF9; une carte mentionne la personne, ou bien la personne est soit destinataire soit exp&#xE9;diteur. De m&#xEA;me la carte peut &#xEA;tre r&#xE9;dig&#xE9;e en un lieu, ou adress&#xE9;e &#xE0; une adresse. Mais la carte peut encore repr&#xE9;senter un lieu&#x2026;</p></note>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Analyse des documents </head>
        <list>
          <item>quels sont les unites que nous souhaitons traiter?</item>
          <item>comment sont-ils structures (quels composants, quels attributs)?</item>
          <item>est-ce que les occurrences de ces objets sont clairement identifiables dans un flux
            de texte?</item>
        </list>
        <p rend="box">Essayons cela avec ces trois documents:</p>
        <note><p>Je vous propose avec l&#x2019;exercice qui vient de vous m&#xEA;me identifier un certain nombre de choses.</p></note>
      </div><div xmlns="http://www.tei-c.org/ns/1.0"><head>Document A</head>
        <figure><graphic url="Travaux/carte-1v.png"/>
        <head>une carte postale</head></figure></div><div xmlns="http://www.tei-c.org/ns/1.0"><head>Document B</head>
        <figure><graphic url="Travaux/acteRoyale.jpg"/>
          <head>un manuscrit </head></figure></div><div xmlns="http://www.tei-c.org/ns/1.0"><head>Document C</head>
        <figure><graphic url="Travaux/10010099-1_1.jpg"/>
          <head>un tapuscrit </head></figure></div><div xmlns="http://www.tei-c.org/ns/1.0">
       <head>
       Exercice 2 : analyse d'un document
     </head> 
     <list><item>Dans votre groupe, selectionner d'abord un rapporteur</item><item>Regarder bien votre document. Supposer que vous en avez quelques centaines d'autres
            pareilles.</item><item>Comment est votre document organise? </item>
          <item>Quels sont ses composants essentiels, commun  a tous ces documents ?</item>
          <item>Quels sont ses composants interessants, possible dans tous ces documents ?</item>
          <item>Sauriez vous faire en sorte qu'une autre personne reconnaitrait les memes objets
            ?</item>
          <item>Faire une liste de tous les  objets et proprietes essentiels de votre
            document</item>
          <item>Pr&#xE9;senter cette liste ... et la justifier ! </item></list></div><note xmlns="http://www.tei-c.org/ns/1.0"><p>L&#x2019;une des le&#xE7;ons de cet exercice, c&#x2019;est que l&#x2019;on ne peut pas encoder m&#xE9;caniquement un texte. Toujours int&#xE9;ressant de voir une personne prendre un document et se l&#x2019;approprier.</p></note>
</div>
<?tex \newpage ?>
<div>
        <head>Un encodage TEI</head>
<p xmlns="http://www.tei-c.org/ns/1.0">Dans cet exercice, nous allons nous servir d'oXygen pour : <list>
            <item>le balisage structurel d'un document existant </item>
            <item>l'addition automatique des balises TEI &#xE0; un document OCRis&#xE9;</item>
          </list>
        </p><p xmlns="http://www.tei-c.org/ns/1.0">Comme cas d'&#xE9;tude nous prenons un document concret les <title>Exercices</title> du CCMAA.
          Dans votre dossier <ident>Travaux</ident> vous trouverez des fichiers page-image, et des
          fichiers de texte OCRis&#xE9;, tous les deux extraits automatiquement d'un fichier PDF. Les
          fichiers sont nomm&#xE9;s de mani&#xE8;re constante  <code>pv</code> (proc&#xE8;s-verbal) ou
            <code>rapport</code>, suivi du num&#xE9;ro du proc&#xE8;s ou du rapport, et (dans le cas des
          fichiers images, type <code>.png</code>) le num&#xE9;ro de la page. Vous trouverez &#xE9;galement
          l'ensemble des images sur <ptr target="http://www.islamic-art.org/comitte/BArchMain.asp "/>. </p><p xmlns="http://www.tei-c.org/ns/1.0">Nous proposons deux &#xE9;tapes distinctes pour ce travail: <list type="ordered">
            <item>correction textuelle du fichier OCRis&#xE9;</item>
            <item>conversion en doc TEI valide</item>
          </list>
        </p><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Correction du fichier OCRis&#xE9; </head>
        <p>C'est un travail fastidieux et inint&#xE9;ressant, mais n&#xE9;cessaire. D'un point de vue technique
          il n'y a pas grand chose &#xE0; dire l&#xE0; dessus : il faut faire une relecture attentive et
          corriger les fautes d'OCR sous contr&#xF4;le des pages images, voil&#xE0; tout. Cela pourrait peut-&#xEA;tre s'effectuer comme un travail collectif
          en mode crowd sourcing par exemple sur Google Docs ou avec n'importe quel autre outil en
          ligne ou locale. </p>
        <p>Nous vous proposons en tout cas de profiter d'un travail de correction d&#xE9;j&#xE0; fait! Dans le
          fichier <ident> pv61.txt</ident> vous trouverez une version plus ou moins exacte du
          premier Proc&#xE8;s Verbale du livre que nous allons traiter dans la suite de ces exercices.
          (Pour les curieux un morceau de la version originale est aussi disponible dans le fichier
            <ident>pv61-debut-orig.txt</ident>)</p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Cr&#xE9;ation d'un document TEI</head>
        <p>Comme toujours quand on cr&#xE9;e un document TEI XML, il faut penser au sch&#xE9;ma concern&#xE9;.
          Demain, nous allons voir l'inter&#xEA;t de cr&#xE9;er un sch&#xE9;ma plus adapt&#xE9; &#xE0; notre projet ; pour le
          moment nous nous contentons d'un sch&#xE9;ma tr&#xE8;s g&#xE9;n&#xE9;rique, qui permet de faire tout ce qui est
          possible dans la TEI. </p>
        <list>
          <item>D&#xE9;marrez oXygen....</item>
          <item>Cliquez sur l'ic&#xF4;ne Nouveau en haut &#xE0; gauche (ou s&#xE9;lectionnez Nouveau du menu
            Fichier, ou tapez CTRL-N) pour ouvrir la bo&#xEE;te de dialogue Nouveau</item>
          <item>Dans le dialogue Nouveau, choisissez <ident>Cadre des mod&#xE8;les</ident>, ensuite
              <ident>TEI P5</ident>, puis <ident>All</ident>, pour s&#xE9;lectionner le sch&#xE9;ma TEI-All. </item>
          <item>Cliquez le bouton <ident>Cr&#xE9;er</ident> en bas. Un document gabarit s'affiche que
            nous allons compl&#xE9;ter. </item>
          <item>Pour l'instant nous laissons de c&#xF4;t&#xE9; le TEI Header. Enlevez d'abord le contenu du
              <gi>body</gi> (<code>&lt;p&gt;Some text here.&lt;/p&gt;</code>). Nous allons remplacer cela. </item>
          <item>Notre document n'est plus conforme : le <gi>body</gi> doit contenir un autre &#xE9;l&#xE9;ment
            (vous voyez en bas une liste des possibilit&#xE9;s assez nombreuses offertes par ce sch&#xE9;ma)</item>
          <item>Tapez <code>&lt;div type="proces"&gt;</code></item>
          <item>oXygen ajoute la balise fermante <code>&lt;/div&gt;</code> et le curseur reste en
            attente de contenu pour cet &#xE9;l&#xE9;ment <gi>div</gi></item>
          <item>Dans le menu <ident>Document</ident>, s&#xE9;lectionnez <ident>Fichier</ident>, et
            ensuite <ident>Ins&#xE9;rer un fichier</ident> ; puis naviguez jusqu'au fichier
              <ident>pv61.txt</ident> dans le dossier Travaux et s&#xE9;l&#xE9;ctionnez-le.</item>
          <item>Pour assurer une affichage correcte par oXygen, ce fichier commence par une ligne <code>&lt;?xml version="1.0" encoding="UTF-8"?&gt;</code>; il faut d'abord l'enlever. 
            parce qu'elle n'est plus n&#xE9;cessaire.</item>
          <!-- text file needs to be labelled as UTF8 -->
          <item>Votre document est plein de taches rouges! ne vous inqui&#xE9;tez-pas...</item>
        </list>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Balisage minimale de la structure du document</head>
        <list>
          <item>En t&#xEA;te du document se trouvent les titres. S&#xE9;lectionnez avec la souris toute l'&#xE9;tendue
            de texte <code>COMITE DE CONSERVATION...Proces-verbal no 61</code>. </item>
          <item>Tapez CTRL-E, et balisez ce morceau de texte comme <gi>head</gi></item>
          <item>Mettez le curseur entre <code>ARABE</code> et <code>Proc&#xE8;s</code>. Tapez ALT-MAJ-D
            pour diviser en deux ce <gi>head</gi>. </item>
          <item>De la m&#xEA;me fa&#xE7;on, s&#xE9;lectionnez l'&#xE9;tendue de texte de <code>(Voir</code> jusqu'&#xE0;
              <code>&#xE9;taient presents</code> et balisez-le comme deux &#xE9;l&#xE9;ments <gi>p</gi></item>
          <item>S&#xE9;lectionnez la liste des noms de personnes pr&#xE9;sentes, et balisez-la d'abord comme
            une <gi>list</gi> avec CTRL-E </item>
          <item>Le texte de la liste reste s&#xE9;l&#xE9;ctionn&#xE9;, qui vous permet de le baliser encore avec
              <gi>item</gi></item>
          <item>Divisez ce seul item en plusieurs, un pour chacun des noms, de sorte que le d&#xE9;but de
            votre document maintenant ressemble &#xE0; ceci :</item>
        </list>
        <p><graphic url="../Graphics/pv-start.png" height="8cm"/></p>
        <list>
          <item>Effectivement, le reste du document est encore un <gi>list</gi>. Donc, m&#xEA;me jeu :
            s&#xE9;l&#xE9;ctionnez tout le document &#xE0; partir de <code>1&#xB0; Lecture est faite</code> jusqu'&#xE0; la
            fin du document ins&#xE9;r&#xE9;, juste avant la balise <tag>/div</tag>.</item>
          <item>Avec CTRL-E, balisez tout cela avec un <gi>list</gi>, et puis avec un <gi>item</gi>
          </item>
          <item>Toutes les taches rouges disparaissent! Est-ce que votre document est valide? Oui au
            sens syntaxique, mais evidemment non, parce qu'il est plein de mensonges! Cette liste
            devrait contenir plus d'un seul <gi>item</gi>!</item>
          <item>Remonter au d&#xE9;but du document. Mettez le curseur devant le chiffre <code>2&#xB0;</code>
            qui signale le d&#xE9;but du deuxi&#xE8;me item. Tapez ALT-MAJ-D.</item>
          <item>Faites pareil pour tous les items num&#xE9;rot&#xE9;s qui suivent ... attention &#xE0; celui
            num&#xE9;rot&#xE9; 4! Il contient une liste imbriqu&#xE9;e avec trois items, num&#xE9;rot&#xE9;s <code>a)</code>
            <code>b)</code> (qui lui m&#xEA;me contient <emph>encore</emph> une liste de deux items
            num&#xE9;rot&#xE9;s 1&#xB0; et 2&#xB0; ) et <code>c)</code> ... </item>
          <item>Pour contr&#xF4;ler si vos listes sont bien structur&#xE9;es, vous pouvez utiliser la vue
              <ident>Sommaire</ident>: s&#xE9;l&#xE9;ctionner <ident>afficher la vue</ident> dans le menu <ident>Fen&#xEA;tre</ident>
            et choisir Sommaire pour l'afficher si n&#xE9;cessaire. Il devrait ressembler &#xE0; ceci: </item>
        </list>
        <p><graphic url="../Graphics/pv-sommaire.png" height="7cm"/></p>
</div><div xmlns="http://www.tei-c.org/ns/1.0"><head>Balisage d'une table  (facultatif) </head>      <p>A la fin de la page 8, dans l'<gi>item</gi> 5&#xB0;, on voit cette petite table : </p>
        <p><graphic url="../Graphics/pv-table.png" height="5cm"/>.</p>
        <p>Comment baliser cela? La TEI nous propose les balises <gi>table</gi>, contenant des
            <gi>row</gi> (rang), contenant des <gi>cell</gi> (cellule). Vous pouvez utiliser la m&#xEA;me
          strat&#xE9;gie que vous avez d&#xE9;j&#xE0; apprivois&#xE9;e pour les listes...</p>
        <list>
          <item>S&#xE9;lectionnez tout le contenu de la liste, de <code>TRAITEMENT ACTUEL</code> jusqu'&#xE0;
              <code>Total 336</code></item>
          <item>En utilisant CTRL-E, balisez cela avec <gi>table</gi>, puis avec <gi>row</gi>, puis
            avec <gi>cell</gi></item>
          <item>Le premier rang contient les titres des colonnes. La premi&#xE8;re colonne n'a aucun
            titre, donc il faut ajouter un <gi>cell</gi> vide : mettez votre curseur
              <emph>avant</emph> le mot <code>TRAITEMENT</code> et diviser le <gi>cell</gi> avec
            ALT-MAJ-D</item>
          <item>Diviser encore, apr&#xE8;s le mot <code>ACTUEL</code>, apr&#xE8;s le mot <code>CLASSE</code>,
            et apr&#xE8;s le mot <code>ALLOUE</code>
          </item>
          <item>Maintenant il faut diviser non pas les <gi>cell</gi>, mais les <gi>row</gi>. Pour
            faire cela, mettez le curseur <emph>avant</emph> la balise <gi>cell</gi> que vous venez
            d'ajouter. Cette balise devrait indiquer le d&#xE9;but de la premi&#xE8;re cellule du deuxi&#xE8;me rang.
            Tapez ALT-MAJ-D pour cr&#xE9;er ce deuxi&#xE8;me rang, et voil&#xE0; !</item>
          <item>Maintenant, consid&#xE9;rons les deux mentions <code>L.E.</code>. Par simplicit&#xE9;, nous
            vous proposons de les consid&#xE9;rer comme des labels de colonnes, et donc d'ajouter des
              <gi>cell</gi> vides autour d'eux. Mettez le curseur avant le premier <code>L.E.</code>
            et divisez avec ALT-MAJ-D.</item>
          <item>Mettez le curseur avant le deuxi&#xE8;me <code>L.E.</code> et divisez encore -- et
            encore, car le deuxi&#xE8;me s'applique au 4&#xE8;me colonne, non pas au 3&#xE8;me.</item>
          <item>Mettez le curseur avant le mot <code>Elias</code> et divisez encore. </item>
          <item>Maintenant on va cr&#xE9;er le 3&#xE8;me rang. Mettez le curseur avant la balise <gi>cell</gi>
            qui pr&#xE9;c&#xE8;de le mot Elias, et divisez !</item>
          <item>Continuez ainsi... si tout va bien, dans la vue <ident>Sommaire</ident> vous allez voir quelque
            chose comme ceci :</item>
        </list>
        <p><graphic url="../Graphics/pv-table-sommaire.png" height="5cm"/></p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Balisage des pages</head>
        <p>Notre balisage se focalise sur la structuration logique du document : il est aussi tr&#xE8;s
          utile de repr&#xE9;senter quelques aspects de sa structuration physique, notamment d'indiquer
          les fronti&#xE8;res des pages, qui sont indiqu&#xE9;es dans cette transcription par des lignes
          telles que <code>--12--</code>, indiquant le d&#xE9;but de la page num&#xE9;rot&#xE9;e 12. </p>
        <p>oXygen int&#xE8;gre plusieurs outils pour faire syst&#xE9;matiquement des recherches et des
          remplacements dans le texte Nous allons nous servir d'une recherche par <term>expression
            r&#xE9;guli&#xE8;re</term>, pour retrouver tous ces codes et puis les remplacer avec la balise
          souhait&#xE9;e (<gi>pb</gi>)</p>
        <list>
          <item>Mettez le curseur au d&#xE9;but du document</item>
          <item>S&#xE9;lectionnez <ident>Rechercher/Remplacer</ident> dans le menu
              <ident>Recherche</ident> (ou tapez CTRL-F)</item>
          <item>Dans la fen&#xEA;tre de  dialogue qui s'affiche: <list>
              <item>Tapez <code>--(\d+)--</code> dans la fen&#xEA;tre <ident>Texte &#xE0; rechercher</ident>
              </item>
              <item>Tapez <code>&lt;pb facs="pv61_\1.png" n="\1"/&gt;</code> dans la fen&#xEA;tre
                  <ident>Remplacer par</ident></item>
              <item>En bas, cochez la case <ident>Expression r&#xE9;guli&#xE8;re</ident></item>
            </list></item>
          <item>Cliquez le bouton <ident>Tout remplacer</ident></item>
        </list>
        <p><graphic url="../Graphics/pv-recherche.png" height="8cm"/></p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Pour terminer...</head>
        <p>Il y a &#xE9;videmment beaucoup de choses qui restent &#xE0; faire pour enrichir notre
          balisage. Nous terminerons avec quelques propositions d'am&#xE9;lioration que nous vous invitons
          &#xE0; explorer... </p>
        <list>
          <item>Tout au fond du document il y a la phrase <code>La s&#xE9;ance est lev&#xE9;e...</code> suivi
            des signatures. Cela ne fait pas partie du 19&#xE8;me item! Enlever ces deux phrases, et
            mettez-les dans une meilleure situation. Vous pouvez les baliser avec <gi>p</gi>, ou
            avec les balises plus sp&#xE9;cifiques <gi>closer</gi> et <gi>signed</gi></item>
          <item>La num&#xE9;rotation des items n'est pas forc&#xE9;ment une partie de leur contenu. Vous
            pourriez syst&#xE9;matiquement enlever les <code>2&#xB0;</code>, <code>3&#xB0;</code> etc. Si vous
            souhaitez les garder vous pourriez les encoder comme valeur d'un attribut <att>n</att>
            par ex <code>&lt;item n="2&#xB0;"&gt;Le proces-verbal...&lt;/item&gt;</code></item>
          <item>Il y a plusieures phrases qui sont des renvois, comme par exemple <code>Voir le 157&#xB0;
              rapport de la deuxi&#xE8;me Commision</code>. Vous pourriez les baliser avec
            <gi>ref</gi></item>
          <item>Ajouter le num&#xE9;ro du proc&#xE8;s-verbal (61) comme valeur d'un attribut <att>n</att> sur
            le <tag>div type="proces"</tag>
          </item>
          <item>Il y a des descriptions bibliographiques, notamment dans le 14&#xE8;me item, que vous
            pourriez baliser avec <gi>bibl</gi></item>
          <item>Il reste encore une liste &#xE0; encoder dans le 15&#xE8;me item </item>
          <item>Il y a des noms de personnes et de lieux partout : on reviendra sur cet aspect plus tard; donc
            laissez cela pour l'instant</item>
          <item>Il y a toujours l'ent&#xEA;te (<gi>teiHeader</gi>) ... que nous allons aborder tout de
            suite !</item>
        </list>
        <!--p>S'il vous reste du temps, nous vous invitons de répéter cet exercice avec un des Rapports
          : <ident>rapport161.txt</ident> par exemple est déjà corrigé des fautes OCR ! </p-->
        <p>N'oubliez pas d'enregistrer votre travail : nous allons le retravailler plus tard.
        </p>
      </div>
</div>
<?tex \newpage ?>
<div>
        <head>Balisage du CCMAA : l'ent&#xEA;te</head>
<p xmlns="http://www.tei-c.org/ns/1.0">Dans cet exercice, nous allons nous servir d'oXygen pour : <list>
            <item>explorer les balises du TEI header </item>
            <item>compl&#xE9;ter l'ent&#xEA;te de notre document </item>
          </list>
          </p><div xmlns="http://www.tei-c.org/ns/1.0">   <head>Ajout des metadonn&#xE9;es </head>
          <p>Evidemment, le TEI Header permet  beacoup de possibilit&#xE9;s et c'est &#xE0; vous de d&#xE9;cider entre elles ;
          en choisissant celles qui vous semblent les plus utiles selon les objectifs de votre projet.
          Nous proposons ici un noyau, suffisant pour le reste de cette formation. </p>
        <p>Actuellement, notre header ne contient que : <egXML xmlns="http://www.tei-c.org/ns/Examples">
            <teiHeader>
              <fileDesc>
                <titleStmt>
                  <title>Title</title>
                </titleStmt>
                <publicationStmt>
                  <p>Publication Information</p>
                </publicationStmt>
                <sourceDesc>
                  <p>Information about the source</p>
                </sourceDesc>
              </fileDesc>
            </teiHeader>
          </egXML> Ce sont les trois composantes essentielles : une identification de l'objet
            (<gi>titleStmt</gi>), des informations sur sa diffusion (<gi>publicationStmt</gi>) et
          sur sa source (<gi>sourceDesc</gi>). Avant de proc&#xE9;der, il faut d&#xE9;finir un point question peut &#xEA;tre
          pas aussi &#xE9;vident aue cela : de quel<soCalled>objet</soCalled> s'agit-il? Nous vous
          proposons de cr&#xE9;er un seul <gi>teiHeader</gi> pour tout le fascicule 11 du CCMAA, mais on
          pourrait &#xE9;galement imaginer un header pour chaque proc&#xE8;s-verbal, ou m&#xEA;me pour chacun
          des rapports. </p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Title Statement</head>
        <list>
          <item>Ajoutez un titre clair : par exemple <code>&lt;title&gt; CCMAA Exercice 1894, 11&#xE8;me
              fascicule, en version TEI-XML &lt;/title</code>. </item>
          <item>Mettez le curseur apr&#xE8;s ce <gi>title</gi> mais avant la balise <tag>/titleStmt</tag>
            et tapez un chevron. oXygen vous pr&#xE9;sente une liste de tous les &#xE9;l&#xE9;ments disponibles &#xE0;
            ce point. </item>
          <item> Faites votre s&#xE9;l&#xE9;ction ! Vous pouvez peut &#xEA;tre ajouter un <gi>respStmt</gi> pour
            indiquer qui est responsable de la num&#xE9;risation, ou un <gi>funder</gi> ou
              <gi>sponsor</gi> pour indiquer que ce workshop est organis&#xE9; sous l'&#xE9;gide du CNRS. </item>
          <item>Ensuite mettez le curseur apr&#xE8;s la balise <tag>/titleStmt</tag> et tapez un chevron,
            pour voir quels &#xE9;l&#xE9;ments sont permis avant le <gi>publicationStmt</gi> : pas grand chose
            d'int&#xE9;ressant. </item>
        </list>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Publication Statement</head>
        <list>
          <item>Enlevez l'&#xE9;l&#xE9;ment <gi>p</gi> et ajoutez des informations plus pr&#xE9;cises sur la
            diffusion de ce fichier, par exemple le <gi>publisher</gi> est <code>Lou Burnard
              Consulting</code>, la <gi>date</gi> est <code>septembre 2015</code>, etc. </item>
          <item>Ajoutez aussi une notice de disponibilit&#xE9; (<gi>availability</gi>) pour &#xE9;viter des
            probl&#xE8;mes de droits, par ex: <egXML xmlns="http://www.tei-c.org/ns/Examples">
              <publicationStmt>
                <publisher>Lou Burnard Consulting</publisher>
                <date>septembre 2015</date>
                <availability>
                  <licence>CC-BY-SA</licence>
                </availability>
              </publicationStmt></egXML></item>
        </list>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Source Description</head>
        <list>
          <item>Nous vous proposons d-ins&#xE9;rer ici une description bibliographique de la source
            imprim&#xE9;e, correcte et compl&#xE8;te. La balise <gi>bibl</gi> contiendra cela ; son contenu
            peut &#xEA;tre pris de la page de titre du volume original, par ex. <egXML xmlns="http://www.tei-c.org/ns/Examples">
              <bibl><author>Comite de conservatioon des monuments de l'art arabe</author>
                <title>Exercice 1894</title>
                <edition>2eme edition</edition>
                <pubPlace>Le Caire</pubPlace>
                <date>1908</date></bibl>
            </egXML>
          </item>
          <item>Le <gi>sourceDesc</gi> sert aussi &#xE0; h&#xE9;berger les listes d'entit&#xE9;s qui
            sont r&#xE9;f&#xE9;renc&#xE9;es dans un document. Puisque nous allons cr&#xE9;er de telles listes un peu
            plus tard, nous vous proposons d'ajouter d&#xE8;s maintenant les balises requises (mais sans
            contenu pour l'instant): <egXML xmlns="http://www.tei-c.org/ns/Examples">
              <sourceDesc>
                <bibl>
                  <!-- comme ci dessus --></bibl>
                <listPerson>
                  <person/>
                </listPerson>
                <listPlace>
                  <place/>
                </listPlace>
                <listOrg>
                  <org/>
                </listOrg>
              </sourceDesc>
            </egXML></item>
          <item>Examinez les autres balises disponibles apr&#xE8;s le <gi>fileDesc</gi> pour en faire
            votre s&#xE9;lection.</item>
          <item>Et enfin, n'oubliez pas d'ajouter un <gi>revisionDesc</gi> en fin de compte : <egXML xmlns="http://www.tei-c.org/ns/Examples">
              <revisionDesc>
                <change when="AAAA-MM-JJ"> VOTRE NOM ICI ajouta le header</change>
              </revisionDesc></egXML>
          </item>
        </list>
      </div>
</div>
<?tex \newpage ?>
<div>
                <head>Personnalisation de sch&#xE9;ma avec Roma</head>
<p xmlns="http://www.tei-c.org/ns/1.0">Dans cet exercice nous allons : </p><list xmlns="http://www.tei-c.org/ns/1.0" type="bulleted">
                    <item>Conna&#xEE;tre les modules TEI</item>
                    <item>Combiner les modules TEI pour cr&#xE9;er un sch&#xE9;ma personnalis&#xE9;</item>
                    <item>S&#xE9;lectionner un sous-ensemble d'&#xE9;l&#xE9;ments d'un module TEI</item>
                    <item>Associer un sch&#xE9;ma personnalis&#xE9; avec un document TEI-XML dans
                        oXygen</item>
                    <item>Modifier les valeurs l&#xE9;gales des attributs disponibles dans un
                        sch&#xE9;ma</item>
                    <item>G&#xE9;n&#xE9;rer automatiquement la documentation d'un sch&#xE9;ma avec Roma</item>
                </list><div xmlns="http://www.tei-c.org/ns/1.0">
                <head>Cr&#xE9;ation d'un document maximal</head>
                <list>
                    <item>D&#xE9;marrez oXygen.</item>
                    <item>Cliquez sur l'ic&#xF4;ne <ident>Nouveau</ident> en haut &#xE0; gauche (ou
                        s&#xE9;lectionnez <ident>Nouveau</ident> dans le menu <ident>Fichier</ident>, ou
                        tapez <ident>CTRL-N</ident>) pour ouvrir la bo&#xEE;te de dialogue Nouveau</item>
                    <item>Choisissez <ident>Cadre des mod&#xE8;les</ident>, ensuite <ident>TEI
                        P5</ident>, puis <ident>TEI-All</ident>, pour s&#xE9;lectionnez un sch&#xE9;ma TEI
                        maximal. </item>
                    <item>Cliquez sur le bouton <ident>Cr&#xE9;er</ident> en bas. oXygen affiche un
                        document TEI.</item>
                    <item>Enregistrez ce fichier dans votre dossier <ident>Travaux</ident> sous le
                        nom <ident>myTest.xml</ident>.</item>
                </list>
            </div><div xmlns="http://www.tei-c.org/ns/1.0">
                <head>All n'est pas une solution id&#xE9;ale</head>
                <p>Comme vous l'avez d&#xE9;j&#xE0; vu, oXygen propose des &#xE9;l&#xE9;ments et des attributs TEI
                    automatiquement. <list>
                        <item>Dans le document que vous venez de cr&#xE9;er, mettez le curseur &#xE0;
                            l'int&#xE9;rieur de l'&#xE9;l&#xE9;ment <gi>p</gi>.</item>
                        <item>Tapez '&lt;'. oXygen vous offre un menu de tous les &#xE9;l&#xE9;ments
                            disponibles &#xE0; ce point.</item>
                        <item>Passez en revue la liste des noms d'&#xE9;l&#xE9;ment : un "pop-up" appara&#xEE;t
                            pour expliquer la fonction de chacun. Regardez par exemple
                                <gi>address</gi>, <gi>camera</gi>, <gi>incident</gi>,
                                <gi>metamark</gi>, ou <gi>notatedMusic</gi>.</item>
                        <item>Tapez <ident>ESC</ident> pour sortir du menu&#xA0;; supprimez le
                            '&lt;' que vous venez d'ajouter.</item>
                        <item>On a beaucoup de choix... mais dans un projet particulier il n'est
                            gu&#xE8;re probable qu'on ait besoin de tous ces &#xE9;l&#xE9;ments. Avec autant de
                            possibilit&#xE9;s, la probabilit&#xE9; d'introduire des incoh&#xE9;rences ou
                            d'effectuer un mauvais choix est fortement augment&#xE9;e. Cela complexifie
                            &#xE9;galement le traitement des documents XML que nous allons cr&#xE9;er.</item>
                    </list>
                </p>
            </div><div xmlns="http://www.tei-c.org/ns/1.0">
                <head>Cr&#xE9;ation d'un sch&#xE9;ma avec Roma</head>
                <p>Le logiciel Roma vous permet de cr&#xE9;er votre propre sch&#xE9;ma TEI. Notre objectif
                    sera de cr&#xE9;er un sch&#xE9;ma pour tra&#xEE;ter une &#xE9;dition num&#xE9;rique (imaginaire) du CCMAA
                    ... <list>
                        <item>Avec votre navigateur rendez-vous sur <ref target="http://www.tei-c.org/Roma/">http://www.tei-c.org/Roma/</ref>. La page vous propose quatre options:
                                <list type="ordered">
                                <item><hi>Build up&#xA0;:</hi> on cr&#xE9;e une personnalisation en
                                    ajoutant petit &#xE0; petit ce qu'on souhaite avoir en partant d'une
                                    base minimale</item>
                                <item><hi>Reduce&#xA0;:</hi> on fait l'inverse&#xA0;: c'est-&#xE0;-dire
                                    qu'on cr&#xE9;e une personnalisation en retirant petit &#xE0; petit ce
                                    qu'on ne souhaite pas avoir en partant d'une base
                                    maximale</item>
                                <item><hi>Template&#xA0;:</hi> on part des personnalisations d&#xE9;j&#xE0;
                                    propos&#xE9;es par la TEI</item>
                                <item><hi>Open&#xA0;:</hi> on retravaille une personnalisation qu'on
                                    a d&#xE9;j&#xE0; enregistr&#xE9;e. </item>
                            </list>
                        </item>
                        <item>Dans cet exercice, nous choisissons d'abord la premi&#xE8;re solution.
                            Choisissez <ident>build up</ident> et cliquez sur le bouton rouge
                                <ident>start</ident>. </item>
                        <item>Pour r&#xE9;gler les param&#xE8;tres on vous propose : <list>
                                <item><hi>Title&#xA0;:</hi> Changez <code>My TEI Extension'</code>
                                    en (par exemple) <code>TEI pour les CCMAA</code>.</item>
                                <item><hi>Filename&#xA0;:</hi> Changez <code>myTEI</code> en (par
                                    exemple) <ident>tei-ccmaa</ident> (c'est un identifiant, et donc
                                    ne devrait pas inclure de blancs) </item>
                                <item><hi>Language&#xA0;: </hi> Vous pouvez laisser en anglais, mais
                                    ce tutoriel part du principe que vous pr&#xE9;f&#xE9;rez travailler en
                                    fran&#xE7;ais. Cochez donc le bouton devant le mot
                                        <code>fran&#xE7;ais.</code></item>
                                <item><hi>Author name&#xA0;:</hi> Entrez votre propre nom (ou celui
                                    de votre avatar si vous pr&#xE9;f&#xE9;rez) </item>
                                <item>Ne changez pas la description pour l'instant. </item>
                            </list>
                        </item>
                        <item>Cliquez sur le bouton <ident>Save</ident> en bas de page. Vos
                            changements ont &#xE9;t&#xE9; pris en compte : l'interface est maintenant en
                            fran&#xE7;ais, et en haut &#xE0; droite, le nom de la personnalisation sur
                            laquelle vous travaillez est affich&#xE9;.</item>
                        <item>Roma est un logiciel international (plus ou moins). S&#xE9;lectionnez
                            l'onglet <ident>Langage</ident>, et cliquez sur le bouton
                                <ident>Fran&#xE7;ais</ident> pour assurer que la francisation de cet
                            exercice soit maximale ! </item>
                        <item>Encore une fois, cliquez sur <ident>Save</ident> en bas de page.</item>
                    </list>
                </p>
            </div><div xmlns="http://www.tei-c.org/ns/1.0">
                <head>S&#xE9;lection de modules</head>
                <p>Un <term>module</term> est un regroupement d'&#xE9;l&#xE9;ments TEI. Tout &#xE9;l&#xE9;ment TEI est
                    d&#xE9;clar&#xE9; dans un module sp&#xE9;cifique. Par exemple, pour encoder un dictionnaire
                    vous aurez besoin des &#xE9;l&#xE9;ments sp&#xE9;cialis&#xE9;s pour les dicos. Mais ces &#xE9;l&#xE9;ments ne
                    sont pas forc&#xE9;ment int&#xE9;ressants pour l'encodage d'autres types de documents.</p>
                <p>Dans Roma, <list>
                        <item>Cliquez sur l'onglet <ident>Modules</ident> pour v&#xE9;rifier quels
                            modules constitueront votre sch&#xE9;ma</item>
                        <item>Nous avons commenc&#xE9; avec le sch&#xE9;ma minimal. Donc, la liste des modules
                            s&#xE9;lectionn&#xE9;s, affich&#xE9;e &#xE0; droite, ne contient que trois modules. </item>
                        <item>Nous souhaitons disposer des balises pour traiter les entit&#xE9;s nomm&#xE9;es,
                            ainsi que les tableaux. Nous aurons besoin donc d'ajouter des modules
                            suppl&#xE9;mentaires.</item>
                        <item>Cliquez sur le mot <code>ajouter</code> devant la mention du module
                                <ident>namesdates</ident> dans la liste &#xE0; gauche. Ce module va
                            appara&#xEE;tre tout de suite dans la liste &#xE0; droite. </item>
                        <item>R&#xE9;petez cette manoeuvre pour ajouter les deux modules
                                <ident>figures</ident> et <ident>transcr</ident>.</item>
                        <item>Vous avez maintenant un sch&#xE9;ma construit &#xE0; partir des modules :
                                <ident>tei</ident> (Roma ne vous permet pas d'enlever ce module
                            infrastructurel), <ident>core</ident>, <ident>header</ident>,
                                <ident>textstructure</ident>, <ident>figures</ident>,
                                <ident>namesdates</ident> et <ident>transcr</ident>.</item>
                    </list>
                </p>
            </div><div xmlns="http://www.tei-c.org/ns/1.0">
                <head>Inclusion et exclusion des &#xE9;l&#xE9;ments</head>
                <p>Dans ce petit ensemble de modules, il reste quand m&#xEA;me plusieurs &#xE9;l&#xE9;ments sans
                    int&#xE9;r&#xEA;t pour notre projet. <list>
                        <item>Cliquez sur le mot <code>core</code> &#xE0; droite (nota&#xA0;: non pas sur
                            le mot <code>supprimer</code> mais sur le nom du module). Une liste de
                            tous les &#xE9;l&#xE9;ments du module <ident>core</ident> s'affiche. </item>
                        <item>Chaque ligne de cette table contient&#xA0;: <list>
                                <item>le nom canonique d'un &#xE9;l&#xE9;ment</item>
                                <item>une indication de son Inclusion ou exclusion par rapport au
                                    sch&#xE9;ma courant</item>
                                <item>le nom de cet &#xE9;l&#xE9;ement dans le sch&#xE9;ma actuel (normalement
                                    c'est le nom canonique i.e. anglais)</item>
                                <item>un point d'interrogation fournissant un lien vers la page de
                                    r&#xE9;f&#xE9;rence pour cet &#xE9;l&#xE9;ment</item>
                                <item>une description br&#xE8;ve des fonctions de cet &#xE9;l&#xE9;ment</item>
                                <item>un lien qui permet de modifier les attributs de cet
                                    &#xE9;l&#xE9;ment</item>
                            </list>
                        </item>
                        <item>Cette interface vous permet d'explorer la fonction et l'usage de tous
                            les &#xE9;l&#xE9;ments TEI. Prenez un moment pour regarder la page de r&#xE9;f&#xE9;rence
                            pour un ou deux des &#xE9;l&#xE9;ments que vous ne connaissez pas encore. </item>
                        <item>Roma vous permet &#xE9;galement de s&#xE9;lectionner les &#xE9;l&#xE9;ments que vous
                            souhaitez int&#xE9;grer dans votre sch&#xE9;ma.</item>
                        <item>Vous pouvez Inclure ou Exclure tous les &#xE9;l&#xE9;ments d'un module. Cliquez
                            sur le mot <ident>Exclure</ident> dans le titre de la table, et tous les
                            &#xE9;l&#xE9;ments sont exclus par d&#xE9;faut. Cliquez sur le bouton &#xE0; c&#xF4;t&#xE9; d'un &#xE9;l&#xE9;ment
                            pour l'inclure. </item>
                        <item>En bas de la liste des &#xE9;l&#xE9;ments il y a un bouton rouge
                                <ident>Save</ident>, sur lequel il faut cliquer pour enregistrer vos
                            modifications. </item>
                        <item>En haut de la liste il y a un bouton <ident>back</ident> qui vous
                            permet de retourner sur la page pr&#xE9;c&#xE9;dente pour s&#xE9;lectionner un autre
                            module &#xE0; modifier.</item>
                        <item>Pour cr&#xE9;er votre sch&#xE9;ma personnalis&#xE9; proc&#xE9;dez ainsi: <list>
                                <item>Du module <ident>core</ident> vous devez exclure tous sauf les
                                    &#xE9;l&#xE9;ments suivants : author bibl date foreign graphic head hi
                                    item lb list name p pb pubPlace publisher ref respStmt resp
                                    title. </item>
                                <item>Du module <ident>figures</ident> vous devez exclure tous sauf
                                    les &#xE9;l&#xE9;ments suivants : cell figDesc figure row table</item>
                                <item>Du module <ident>header</ident> vous devez exclure tous sauf
                                    les &#xE9;l&#xE9;ments suivants : availability change edition fileDesc
                                    licence publicationStmt revisionDesc sourceDesc teiHeader
                                    titleStmt. </item>
                                <item>Du module <ident>textstructure</ident> vous devez exclure tous
                                    sauf les &#xE9;l&#xE9;ments suivants : TEI back body byline closer div
                                    docAuthor docDate docImprint docTitle front signed text
                                    titlePage titlePart</item>
                                <item>Du module <ident>transcr</ident> vous devez exclure tous les
                                    &#xE9;l&#xE9;ments, sans exception.</item>
                            </list></item>
                        <item>N'oubliez pas de cliquer sur le bouton rouge <ident>Save</ident> en
                            bas de page apr&#xE8;s avoir effectu&#xE9; votre s&#xE9;l&#xE9;ction dans chaque module
                            !</item>
                    </list>
                </p>
            </div><div xmlns="http://www.tei-c.org/ns/1.0">
                <head>Cr&#xE9;ation de sch&#xE9;ma</head>
                <p>
                    <list>
                        <item>Cliquez sur l'onglet <ident>Sch&#xE9;ma</ident>. Vous pouvez choisir entre
                            plusieurs langages de sch&#xE9;ma&#xA0;: la TEI se d&#xE9;finit ind&#xE9;pendamment de
                            toute langue, afin de pouvoir g&#xE9;n&#xE9;rer tous ces formats.</item>
                        <item>Nous vous conseillons de g&#xE9;n&#xE9;rer un sch&#xE9;ma ou bien en Relax NG Compact
                            Syntax, ou en Relax NG XML Syntax.</item>
                        <item>Cliquez sur <ident>Generate</ident> et votre navigateur vous envoie un
                            fichier de sch&#xE9;ma. Vous devez enregistrer ce fichier dans le m&#xEA;me
                            dossier que le fichier <ident>myTest.xml</ident> que vous avez cr&#xE9;&#xE9; au
                            d&#xE9;but de cet exercice. </item>
                        <item rend="bold">Ne fermez pas votre navigateur : vous en aurez encore
                            besoin.</item>
                    </list>
                </p>
            </div><div xmlns="http://www.tei-c.org/ns/1.0">
                <head>Association de sch&#xE9;ma et fichier en oXygen</head>
                <p>Jusqu'&#xE0; pr&#xE9;sent, oXygen associait le sch&#xE9;ma <ident>tei_all </ident>avec votre
                    fichier <ident>myTest.xml</ident>. <list>
                        <item>Revenez dans oXygen et ouvrez votre fichier</item>
                        <item>S&#xE9;lectionnez <ident>Sch&#xE9;ma -- Associer un sch&#xE9;ma</ident> du menu
                                <ident>Document</ident>. (Remarquez l'ic&#xF4;ne bleue et rouge pour cette
                            action qui devrait &#xE9;galement apparaitre sur la barre &#xE0; outils) </item>
                        <item>Dans la bo&#xEE;te de dialogue qui s'affiche, cliquez sur la petite ic&#xF4;ne
                            de dossier &#xE0; c&#xF4;t&#xE9; de <code>URL</code> pour naviguer vers le sch&#xE9;ma que
                            vous venez de cr&#xE9;er avec Roma. Cliquez sur <ident>OK</ident>.</item>
                        <item>Au d&#xE9;but de votre fichier XML-TEI, oXygen va ins&#xE9;rer une ligne qui
                            ressemble &#xE0; ceci: <egXML xmlns="http://www.tei-c.org/ns/Examples">
                                &lt;?xml-model href="myTEI.rng" type="application/xml"
                                ns="http://relaxng.org/ns/structure/1.0"?&gt;</egXML>
                        </item>
                        <item>S'il y a d'autres lignes du m&#xEA;me type, enlevez-les pour &#xEA;tre s&#xFB;r
                            !</item>
                    </list>
                </p>
            </div><div xmlns="http://www.tei-c.org/ns/1.0">
                <head>Confirmation</head>
                <p>Vous vous souvenez de ces &#xE9;l&#xE9;ments bizarres 'address' , 'camera', 'musicNotation'
                    etc. qui &#xE9;taient disponibles au sein d'un paragraphe&#xA0;? <list>
                        <item>Mettez le curseur apr&#xE8;s une balise ouvrante <gi>p</gi>, et tapez
                            '&lt;' pour voir de nouveau la liste des &#xE9;l&#xE9;ments disponibles.</item>
                        <item>Tous les &#xE9;l&#xE9;ments que vous avez supprim&#xE9;s ont disparu&#xA0;? C'est
                            bien&#xA0;! Sinon, peut-&#xEA;tre que vous avez oubli&#xE9; de cliquer sur le
                            bouton <ident>Save</ident> apr&#xE8;s les avoir inclus/exclus... essayez
                            encore !</item>
                    </list>
                </p>
            </div><div xmlns="http://www.tei-c.org/ns/1.0">
                <head>Comment limiter les valeurs d'un attribut</head>
                <p>Nous avons vu qu'il est tr&#xE8;s utile de supprimer tel ou tel &#xE9;l&#xE9;ment de notre
                    sch&#xE9;ma. Que peut-on faire pour limiter les valeurs l&#xE9;gales de ses attributs ?
                    (Notez qu'en g&#xE9;n&#xE9;ral les attributs TEI sont d&#xE9;finis d'une mani&#xE8;re tr&#xE8;s
                    permissive : vous pouvez taper n'importe quoi). Supposons que nous d&#xE9;sirons
                    limiter les valeurs possibles pour l'attribut <att>type</att> sur <gi>list</gi><list>
                        <item>Revenez dans Roma</item>
                        <item>Cliquez sur l'onglet <ident>Modules</ident></item>
                        <item>Cliquez sur le module <ident>core</ident></item>
                        <item>Trouvez le rang o&#xF9; est d&#xE9;fini l'&#xE9;l&#xE9;ment l<gi>ist</gi> et cliquez sur
                                <ident>Changer les Attributs</ident> tout &#xE0; droite.</item>
                        <item>Une table des attributs disponibles pour cet &#xE9;l&#xE9;ment s'affiche. Vous
                            pouvez inclure ou exclure des attributs si cela vous int&#xE9;resse. Pour le
                            moment essayons quelque chose d'autre. </item>
                        <item>Descendez jusqu'&#xE0; <att>type</att> et cliquez sur l'attribut. Une page
                            s'affiche, qui vous permet de v&#xE9;rifier plusieurs options pour cet
                            attribut&#xA0;: <list>
                                <item><hi>Facultatif&#xA0;?</hi> Est-ce qu'il faut fournir une
                                    valeur pour cet attribut ou est-il facultatif&#xA0;? Supposons
                                    que nous d&#xE9;sirons un sch&#xE9;ma dans lequel la pr&#xE9;sence d'une valeur
                                    de <att>type</att> sur <gi>list</gi> soit obligatoire&#xA0;:
                                    dans ce cas, s&#xE9;lectionnez <val>no</val>.</item>
                                <item><hi>Contenu&#xA0;:</hi> Combien de valeurs (une ou plusieurs)
                                    sont permises pour cet attribut, et de quelle type (texte,
                                    num&#xE9;ro, date...) ? Choisissons une seule valeur de type
                                        <val>text</val>. </item>
                                <item><hi>Valeur par d&#xE9;faut :</hi> nous permet de proposer une
                                    valeur par d&#xE9;faut pour l'attribut, dans le cas o&#xF9; aucune valeur
                                    n'est fournie dans le document. Laissez cela vide, puisque nous
                                    avons d&#xE9;j&#xE0; d&#xE9;cid&#xE9; de rendre obligatoire la pr&#xE9;sence d'une
                                    valeur.</item>
                                <item><hi>Liste ferm&#xE9;e :</hi> nous permet de pr&#xE9;ciser si la liste de
                                    valeurs propos&#xE9;es est une liste fixe impossible &#xE0; augmenter ou
                                    non. Dans notre sch&#xE9;ma, c'est une liste ferm&#xE9;e, donc r&#xE9;pondez
                                        <val>Yes</val>&#xA0;!</item>
                                <item><hi>Liste de valeurs&#xA0;:</hi> nous permet de sp&#xE9;cifier les
                                    valeurs permises pour cet attribut dans notre sch&#xE9;ma. Les
                                    valeurs sont propos&#xE9;es sous la forme d'une seule ligne, chaque
                                    valeur s&#xE9;par&#xE9;e par une virgule. Entrez donc la s&#xE9;quence suivante
                                        (<hi>sans blancs</hi>)
                                        <code>present,proces,simple,inconnu</code>.</item>
                                <item><hi>Description&#xA0;:</hi> nous permet de modifier la
                                    description de cet attribut. Vous pouvez la changer comme vous
                                    le souhaitez&#xA0;: par exemple, modifier "d&#xE9;crit la forme de la
                                    liste" en "sp&#xE9;cifie la cat&#xE9;gorie de la liste selon notre syst&#xE8;me
                                    de classification".</item>
                            </list>
                        </item>
                        <item rend="bold">Cliquez sur le bouton <ident>Save</ident> en bas de la
                            page ! </item>
                    </list>
                </p>
            </div><div xmlns="http://www.tei-c.org/ns/1.0">
                <head>Essayons de nouveau...</head>
                <p>Est-ce que nous avons r&#xE9;ussi? Vous connaissez maintenant la d&#xE9;marche...&#xA0;: <list>
                        <item>Cliquez sur l'onglet 'Sch&#xE9;ma' </item>
                        <item>Choisissez l'un des formats de sch&#xE9;ma</item>
                        <item>Cliquez sur 'G&#xE9;n&#xE9;rer' </item>
                        <item>Trouvez le fichier g&#xE9;n&#xE9;r&#xE9; et t&#xE9;l&#xE9;charg&#xE9;; copiez-le sur l'ancienne
                            version pour la remplacer</item>
                        <item rend="bold">Ne fermez pas votre Navigateur Internet !</item>
                        <item>Revenez dans votre fichier <ident>myTest.xml</ident> dans oXygen;
                            choisir <ident>Document -&gt; Valider -&gt; Validate (cache)</ident>
                        </item>
                        <item>Si tout va bien, votre document reste valide : il y a un petit carr&#xE9;
                            vert. </item>
                        <item>Maintenant il faut ajouter une <gi>list</gi> quelque part, par exemple
                            a la suite d'un <gi>p</gi>. Essayez le!</item>
                        <item>Par d&#xE9;faut une liste de type simple est propos&#xE9;e (c'est un bug): mais
                            en tout cas notre document n'est plus valide&#xA0;: il y a un carr&#xE9;
                            rouge en haut&#xA0;! En bas vous voyez le message <code>element "list"
                                incomplete; missing required element "item"</code> : une liste vide
                            n'est pas acceptable. Ajoutez donc un &#xE9;l&#xE9;ment <gi>item</gi></item>
                        <item>Supprimer la mention <code>type="simple"</code> et tapez un blanc.
                            oXygen propose une liste d'attributs disponibles. D&#xE9;roulez-la jusqu'&#xE0;
                                <att>type</att> et notez que cet attribut est affich&#xE9; en gras, pour
                            signaler que sa pr&#xE9;sence est obligatoire.</item>
                        <item>S&#xE9;lectionnez <att>type</att> et notez que oXygen vous propose la liste
                            des valeurs que nous avions pr&#xE9;d&#xE9;finies dans notre sch&#xE9;ma. </item>
                        <item>Choisissez l'une de ces valeurs, p.ex. 'proces', et votre document
                            redevient valide, avec un petit carr&#xE9; vert.</item>
                    </list>
                </p>
                <p>Maintenant, essayons l'&#xE9;preuve d&#xE9;cisive. Retrouvez le document XML-TEI que vous
                    avez cr&#xE9;&#xE9; dans l'exercice pr&#xE9;c&#xE9;dent, qui contient votre version balis&#xE9;e du
                    proces-verbal 61 du CCMAA! Est-ce que celui-ci est valide selon le sch&#xE9;ma que
                    vous venez de cr&#xE9;er?</p>
                <list>
                    <item>Ouvrez votre fichier <ident>pv61.xml</ident> dans oXygen;</item>
                    <item> Choisir <ident>'Schema -&gt; Associer un sch&#xE9;ma'</ident> du menu
                            <ident>Document</ident>et s&#xE9;lectionner le fichier
                            <ident>tei-ccmaa.rnc</ident> g&#xE9;n&#xE9;r&#xE9; par Roma</item>
                    <item>Si tout va bien vous aurez un joli carreau vert : sinon il faut voir
                        s'il ne s'agit pas d'un probl&#xE8;me de balisage ou de sch&#xE9;ma</item>
                </list>
            </div><div xmlns="http://www.tei-c.org/ns/1.0">
                <head>G&#xE9;n&#xE9;ration de documentation</head>
                <p>Tout projet aura besoin de sa documentation interne, qui ne sera pas forc&#xE9;ment
                    optimale si elle est en RelaxNG ! Roma vous permet de g&#xE9;n&#xE9;rer automatiquement
                    des sp&#xE9;cifications compr&#xE9;hensibles, ressemblant &#xE0; la documentation de r&#xE9;f&#xE9;rence
                    de la TEI. <list>
                        <item>Retournez dans votre navigateur et cliquez sur l'onglet
                                <ident>Documentation</ident>. </item>
                        <item>Choisissez <code>HTML web page</code> et cliquez sur
                                <ident>Generate</ident>. </item>
                        <item>Apr&#xE8;s un bref d&#xE9;lai, votre navigateur va recevoir un fichier HTML que
                            vous pourrez lire avec le navigateur. Au d&#xE9;but il y a une table des
                            mati&#xE8;res, avec un lien pour chaque &#xE9;l&#xE9;ment de votre sch&#xE9;ma. D&#xE9;roulez
                            jusqu'au lien pour <gi>list</gi> et cliquez dessus.</item>
                        <item>Notez que la description de son attribut <att>type</att> est modifi&#xE9;e
                            selon vos propositions. (Mais notez aussi que d'autres d&#xE9;tails,
                            notamment les exemples d'usage, ne sont pas modifi&#xE9;s) .</item>
                        <item>Si vous le pr&#xE9;f&#xE9;rez, vous pouvez &#xE9;galement g&#xE9;n&#xE9;rer ce document en
                            format PDF. </item>
                    </list>
                </p>
            </div><div xmlns="http://www.tei-c.org/ns/1.0">
                <head>Enregistrement de la personnalisation</head>
                <p>Nous esp&#xE9;rons que vous aurez maintenant une id&#xE9;e des capacit&#xE9;s de ce syst&#xE8;me de
                    personnalisation. Bien s&#xFB;r, vous ne pouvez pas d&#xE9;finir tout ce qui est le mieux
                    pour votre projet en une seule session. Vous avez donc besoin d'une fa&#xE7;on
                    d'enregistrer la sp&#xE9;cification, pour revenir dessus plus tard. <list>
                        <item>Revenez dans votre navigateur et cliquez sur l'onglet 'Enregistrer'. </item>
                        <item>Votre navigateur vous envoie un fichier XML-TEI, avec le m&#xEA;me nom que
                            votre sch&#xE9;ma, donc <ident>tei-ccmaa.xml</ident>. Enregistrez ce fichier
                            dans votre dossier <ident>Travaux</ident>. </item>
                        <item>Ouvrez ce fichier XML avec oXygen et lisez-le (mais avec les
                            balises&#xA0;: en mode Auteur il y a des d&#xE9;tails significatifs qui sont
                            cach&#xE9;s&#xA0;!). </item>
                        <item>D'abord notez que votre personnalisation h&#xE9;rite des propositions
                            relatives au sch&#xE9;ma minimal duquel vous l'avez d&#xE9;riv&#xE9;. Vous pouvez bien
                            s&#xFB;r modifier ces propositions, en d&#xE9;crivant les objets de votre projet,
                            vos proc&#xE9;dures &#xE9;ventuelles de d&#xE9;finition de sch&#xE9;ma, vos r&#xE8;gles maison de
                            balisage, etc. etc. -- juste comme un manuel d'encodage classique. </item>
                        <item>Ensuite, regardez l'&#xE9;l&#xE9;ment <gi>schemaSpec</gi>. Cet &#xE9;l&#xE9;ment contient
                            l'essentiel de votre personnalisation. Notez qu'il compte un &#xE9;l&#xE9;ment
                                <gi>moduleRef</gi> pour chacun des modules que vous avez
                            s&#xE9;lectionn&#xE9;s, compl&#xE9;t&#xE9; avec une liste des &#xE9;l&#xE9;ments que vous avez
                            exclus.</item>
                        <item>Regardez la sp&#xE9;cification pour <gi>list</gi> (dans un &#xE9;l&#xE9;ment
                                <gi>elementSpec</gi>) pour voir comment nous l'avons modifi&#xE9;.</item>
                        <item>Ce fichier est un document XML-TEI comme tous les autres. Vous pouvez
                            donc faire des modifications, par exemple au d&#xE9;but, pour am&#xE9;liorer votre
                            manuel d'encodage. Pour recharger votre document dans Roma, il faut
                            choisir la quatri&#xE8;me option <code>Open existing customisation</code> sur
                            la page d'accueil de Roma. S'il vous reste du temps, exp&#xE9;rimentez cela
                            !</item>
                    </list>
                </p>
            </div><div xmlns="http://www.tei-c.org/ns/1.0">
                <head>Limitations de Roma</head>
                <p>En effet, Roma n'est qu'une interface web bas&#xE9;e sur un syst&#xE8;me de transformations
                    TEI beaucoup plus complexes. Il est possible de cr&#xE9;er son fichier de
                    personnalisation sans se servir de Roma : c'est une d&#xE9;marche qui permet, par
                    ailleurs, de faire beaucoup plus de choses qui sont rendues impossibles par
                    l'interface de Roma. Par exemple, Roma vous permet de limiter les valeurs
                    l&#xE9;gales d'un attribut, comme vous l'avez vu, mais ne vous permet pas de d&#xE9;finir
                    et de documenter la port&#xE9;e de ces valeurs ; chose qui est simple &#xE0; faire en
                    manipulant directement le format XML-TEI de votre personnalisation (votre
                    'ODD'). </p>
            </div>
</div>
<?tex \newpage ?>
<div>
        <head>Creating  a Manuscript Description</head>
<div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Learning Outcomes</head>
        <p>When you successfully complete this exercise you should be able to: <list type="bulleted">
            <item>Modify a text manuscript description to provide more structure</item>
            <item>Understand the general categories of manuscript description </item>
            <item>Have some experience editing a <gi>teiHeader</gi></item>
          </list>
        </p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Summary</head>
        <p>In this exercises you will edit a basic manuscript description in an existing TEI document. 
          You'll modify the <gi>msDesc</gi> element to categorise manuscript description information into a more detailed
          structure.</p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Starting Up</head>
        <p>Download <ref target="http://tei.it.ox.ac.uk/Talks/2015-03-lyon/msDesc.xml?style=raw">http://tei.it.ox.ac.uk/Talks/2015-03-lyon/msDesc.xml?style=raw</ref>. Save it as 'msDesc.xml'.  Read through the file.</p>
        <p>Have a look at <ref target="http://tei.it.ox.ac.uk/Talks/2015-03-lyon/msDesc.pdf">http://tei.it.ox.ac.uk/Talks/2015-03-lyon/msDesc.pdf</ref> which is printed output from the final version of this description.</p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>A basic <gi>msDesc</gi></head>
        <p>The information to categorise our manuscript description will be taken from a the PDF of the description. 
          There is no requirement with TEI <gi>msDesc</gi> to divide it into all the possible categories
          of information, instead all it requires is at least a <gi>msIdentifier</gi>, other
          information could be stored in a few accompanying paragraphs. This is useful for the
          retrospective conversion of catalogues in other legacy formats to TEI XML. However, in our
          case we want to make as structured a version as we can.
   The current <gi>msDesc</gi> looks like:
          <egXML xmlns="http://www.tei-c.org/ns/Examples">
            
            
<msDesc xml:lang="de" xml:id="zbz-C0010i">
  <msIdentifier>
    <settlement>Z&#xFC;rich</settlement>
    <repository>Zentralbibliothek</repository>
    <idno>Ms. C 10i</idno>
    <altIdentifier type="catalog">
      <idno>47</idno>
    </altIdentifier>
  </msIdentifier>
  <p>Passionarius maior, St. Gallen, 9. Jahrh</p>
  <p>pp. 1v-7r, Vita s. Areleffi, (BHL. Nr. 1568); 
    273r-273v, Vita s. Elegii, (BHL. Nr. 2477); 
    Voraus: 1r, Unvollst&#xE4;ndige Inhaltsangabe, (12. Jahrh.); 
    274r-274v, Folgt: 91. Bruchst&#xFC;ck von BHL. 4992. 
  </p>
  <p>Perg., 274 Bll., 43,0 x 30,5 cm; 
    (5. 6.) Drei primitive Zeichnungen. Initialen. 
    Das Fest "VIII Inventio crucis" in der Inhaltsangabe fehlt im Bande. 
    Ebenso die Passiones Cornelii, Mariae, Luciae, Thomae. 
    (132) Klosterwappen.; 
    Weisser Lederband mit Linnenzeichnung. 
  </p>
  <p>Mohlberg Leo Cunibert, Katalog der Handschriften 
    der Zentralbibliothek Z&#xFC;rich I, Mittelalterliche
    Handschriften, Z&#xFC;rich 1952, S. 18-19.</p>
  <p>Beschr. E. Munding , Das Verzeichnis der St. Galler Heiligenleben und 
    ihrer Handschriften in Cod. Sangall. Nr. 566, in: 
    Texte und Arbeiten I, 3 4 (1918) S. 42 56.; 
    Vgl. P. Lehmann, Mittelalterliche Bibliothekskataloge I (1918) S. 91 99.</p>
</msDesc>   
          </egXML>
          
You will notice this manuscript description is in German(the xml:lang="de" on the <gi>msDesc</gi> element). You do not need to know German to recatalogue it since we have the PDF output as an indication.  Each of the paragraphs covers a different kind of output in a standard manuscript descript.
        </p><p>
          <hi rend="bold">Don't worry that your file will be invalid for large parts of this exercise. You should
              get a <hi rend="italic">happy green square</hi> at the end of it.</hi>
          </p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Look at the <gi>msIdentifier</gi></head>
        <p>Every <gi>msDesc</gi> must have
          an <gi>msIdentifier</gi> and this must be structured with the element allowed inside it. You need an
            <gi>msIdentifier</gi> because if you have no way to refer to the object (its name, id
          number, where it is) then it will be hard to write a description of it.</p>
            <p>Note how elements are prescribed to appear in a particular order (from greatest
              level of granularity to more specific). Notice that most elements cannot be repeated
              (some like <gi>collection</gi> and <gi>altIdentifier</gi> can be). </p>
           </div><div xmlns="http://www.tei-c.org/ns/1.0">
  <head>Giving our description a <gi>head</gi></head>
  <p>The <gi>head</gi> element is used for headings in divisions, but also has a special use in manuscript descriptions to 
  provide a place for easy summary information for the description.  
  <list>
  <item>In this case immediately after the closing <tag>/msIdentifier</tag> 
  you should rename the first paragraph element to <gi>head</gi></item>
    <item>Removing any stray commas as you go, you should then mark "Passionarius maior" as a <gi>title</gi></item>
    <item>"St. Gallen" is its place of origin. The TEI provides a special element (other than <gi>placeName</gi> to mark place of origin. This is called <gi>origPlace</gi>.  Use this to wrap around "St. Gallen".</item>
    <item>The "9. Jahrh" refers to the 9th Century. Like <gi>origPlace</gi> the TEI also provides <gi>origDate</gi> for an origin date. Wrap this around "9. Jahrh.".</item>
    <item>We can be more specific with the <gi>origDate</gi> and give it some attributes <att>notBefore</att> and <att>notAfter</att> [Note: although these are printed with an "@" in front of them, that is just a convention to note they are attributes, there is not an "@" in the XML file.]  These take dates in a YYYY (or YYYY-MM or YYYY-MM-DD) format.  If we want to say the 9th Century provide a <att>notBefore</att> attribute of "0800" and a <att>notAfter</att> date of "0899".  (Yes, we could be more specific down to the day if we were being really pedantic.)</item>
    <item>Basically, you should take this:
<egXML xmlns="http://www.tei-c.org/ns/Examples">
<p>Passionarius maior, St. Gallen, 9. Jahrh</p>
</egXML>
  and make it into:
  <egXML xmlns="http://www.tei-c.org/ns/Examples">
    <head>
      <title>Passionarius maior</title>
      <origPlace>St. Gallen</origPlace>
      <origDate notBefore="0800" notAfter="0899">9. Jahrh.</origDate>
    </head>
  </egXML>
      </item>
  </list>
  </p>
</div><div xmlns="http://www.tei-c.org/ns/1.0">
          <head>Providing an <gi>msContents</gi></head>
          <p>The next paragraph has some basic information for creating an <gi>msContents</gi> element.
            
            This is filled with a series of bibliographic references and other notes concerning particular locations in the manuscripts. 
            
            <list>
              
              <item>After the closing <tag>/head</tag> rename the next paragraph <gi>msContents</gi></item>
              <item>Highlight from "pp.1v-7r" until the first semi-colon, and use surround-with-element (control 'e') to wrap an <gi>msItem</gi>. 
              Inside this <gi>msItem</gi> create a <gi>locus</gi> element for the page location (with a <att>from</att> and <att>to</att> attribute of "1v" and "7r" respectively. The wrap "Vita s. Areleffi" in a <gi>title</gi> element, and the "(BHL. Nr. 1578)" in a <gi>bibl</gi> element.</item>
              <item>Your first <gi>msItem</gi> should look something like this:
                <egXML xmlns="http://www.tei-c.org/ns/Examples">
<msItem>
  <locus from="1v" to="7r">pp. 1v-7r</locus>
  <title>Vita s. Areleffi</title>
  <bibl>(BHL. Nr. 1568)</bibl>
</msItem>
</egXML>
              </item>
              <item>The next <gi>msItem</gi>, up to the next semi-colon, should end up looking similar. Make it look like:
                <egXML xmlns="http://www.tei-c.org/ns/Examples">
<msItem>
  <locus from="273r" to="273v">273r-273v</locus>
  <title>Vita s. Elegii</title>
  <bibl>(BHL. Nr. 2477)</bibl>
</msItem>       
</egXML>
              </item>
              <item>The next <gi>msItem</gi>is really a specialised sort of note. So we're got to wrap it in a note element inside the <gi>msItem</gi>.  It should end up looking like: <egXML xmlns="http://www.tei-c.org/ns/Examples">
<msItem>
  <note> Voraus: <locus from="1r">1r</locus> 
    Unvollst&#xE4;ndige Inhaltsangabe (<date>12. Jahrh.</date>).
  </note>
</msItem>
</egXML>
Note that we haven't really classified the date in a machine-processable way this time. We could, but we're just being lazy.                
</item>
<item> The remaining bit of text inside the <gi>msContents</gi> makes the last msItem.  
  It is a combination of <gi>locus</gi>, a <gi>note</gi> and a <gi>bibl</gi> elements.
<egXML xmlns="http://www.tei-c.org/ns/Examples"><msItem>
    <locus from="274r" to="274v">274r-274v</locus>
    <note>Folgt:</note>
    <bibl>91. Bruchst&#xFC;ck von BHL. 4992.</bibl>
  </msItem>
  </egXML>
</item>
              
              <item>
  Basically, overall you want to take:
  
  <egXML xmlns="http://www.tei-c.org/ns/Examples">
    <p>pp. 1v-7r, Vita s. Areleffi, (BHL. Nr. 1568); 273r-273v, Vita s. Elegii, (BHL. Nr. 2477); Voraus: 1r, Unvollst&#xE4;ndige Inhaltsangabe, (12. Jahrh.); 274r-274v, Folgt: 91. Bruchst&#xFC;ck von BHL. 4992. </p>
    </egXML>
  and turn it into:
  <egXML xmlns="http://www.tei-c.org/ns/Examples">
<msContents>
  <msItem>
    <locus from="1v" to="7r">pp. 1v-7r</locus>
    <title>Vita s. Areleffi</title>
    <bibl>(BHL. Nr. 1568)</bibl>
  </msItem>
  <msItem>
    <locus from="273r" to="273v">273r-273v</locus>
    <title>Vita s. Elegii</title>
    <bibl>(BHL. Nr. 2477)</bibl>
  </msItem>
  <msItem>
      <note> Voraus: <locus from="1r">1r</locus> 
        Unvollst&#xE4;ndige Inhaltsangabe (<date>12. Jahrh.</date>).
      </note>
    </msItem>
  <msItem>
    <locus from="274r" to="274v">274r-274v</locus>
    <note>Folgt:</note>
    <bibl>91. Bruchst&#xFC;ck von BHL. 4992.</bibl>
  </msItem>
</msContents>    
  </egXML>
</item>

            </list></p></div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Giving a <gi>physDesc</gi></head>
        <p>The next paragraph has information about the physical aspects of the manuscript.
          Let's turn it into a <gi>physDesc</gi>! After the closing <tag>/msContents</tag> tag add a new
            <gi>physDesc</gi> element. </p>
        
        
        
        <list>
<item>Create inside this an <gi>objectDesc</gi> with a <att>form</att> attribute of "codex".</item>
          <item>Inside the <gi>objectDesc</gi> create a <gi>supportDesc</gi> with an attribute of <att>material</att> with a value of "perg". Inside the <gi>supportDesc</gi> create a <gi>support</gi> element with the text content "Perg."</item>
<item>As a sibling to the <gi>support</gi> create an <gi>extent</gi> element with two <gi>measure</gi> children.
The first should have a <att>type</att> attribute of "leavesCount", a <att>quantity</att> of "274", 
  and a <att>unit</att> of "leaves".  The content of the element should be "274 Bll".

</item>          

<item>After the closing <tag>/extent</tag> tag, create a <gi>decoDesc</gi> with a <gi>decoNote</gi> inside. Mark the locuses as 5v and 6r, the first <gi>decoNote</gi> should extend to "Thomae".</item><item> 
  Create a second <gi>decoNote</gi> from "(132) Klosterwappen." marking the locus as from 132r.</item>
          <item>As a sibling to <gi>decoDesc</gi> create a <gi>bindingDesc</gi> with a <gi>binding</gi> element in it, which in turn has a <gi>p</gi> element inside that.</item>
          <item>Add the text "Weisser Lederband mit Linnenzeichnung." to this, wrapping the <gi>locus</gi> element around "Lederband".</item>
          
          <item>
            Basically, turn this:
            
            <egXML xmlns="http://www.tei-c.org/ns/Examples">
<p>Perg., 274 Bll., 43,0 x 30,5 cm; (5. 6.) Drei primitive Zeichnungen. Initialen. Das Fest "VIII Inventio crucis" in der Inhaltsangabe fehlt im Bande. Ebenso die Passiones Cornelii, Mariae, Luciae, Thomae. (132) Klosterwappen.; Weisser Lederband mit Linnenzeichnung. </p>
            </egXML>
            into this:
            <egXML xmlns="http://www.tei-c.org/ns/Examples">
<physDesc>
  <objectDesc form="codex">
    <supportDesc material="perg">
      <support>Perg.</support>
      <extent>
        <measure type="leavesCount" quantity="274" unit="leaves">274 Bll.</measure>
        <measure type="pageDimensions">
          <height unit="mm" quantity="430">43,0</height> x <width unit="mm" quantity="305">30,5</width> cm</measure>
      </extent>
    </supportDesc>
  </objectDesc>
  <decoDesc>
    <decoNote> (<locus from="5v">5</locus>. <locus from="6r">6</locus>.) Drei primitive Zeichnungen. Initialen. Das Fest <quote>VIII Inventio crucis</quote> in der Inhaltsangabe fehlt im Bande. Ebenso die Passiones Cornelii, Mariae, Luciae, Thomae. </decoNote>
    <decoNote> (<locus from="132r">132r</locus>) Klosterwappen. </decoNote>
  </decoDesc>
  <bindingDesc>
    <binding>
      <p> Weisser <locus from="Vorderseite">Lederband</locus> mit Linnenzeichnung. </p>
    </binding>
  </bindingDesc>
</physDesc>

            </egXML>
            
            
          </item>
          
        </list>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Noting <gi>additional</gi> Information</head>
        <p>At the very end of your <gi>msDesc</gi> you can include an <gi>additional</gi> element which
          stores other information such as <gi>adminInfo</gi> (for recording administrative events
          of the object), <gi>listBibl</gi> (for listing bibliographic citations about the object),
          and <gi>surrogates</gi> (for listing additional representations of the object). In our case we have a couple paragraphs left:
          <egXML xmlns="http://www.tei-c.org/ns/Examples">
<p>Mohlberg Leo Cunibert, Katalog der Handschriften der Zentralbibliothek Z&#xFC;rich I, Mittelalterliche Handschriften, Z&#xFC;rich 1952, S. 18-19.</p>
<p>Beschr. E. Munding , Das Verzeichnis der St. Galler Heiligenleben und ihrer Handschriften in Cod. Sangall. Nr. 566, in: Texte und Arbeiten I, 3 4 (1918) S. 42 56.; Vgl. P. Lehmann, Mittelalterliche Bibliothekskataloge I (1918) S. 91 99.</p>            
          </egXML>
          The first paragraph has information about the source of the information for the manuscript description. The second has a couple bibliographic citations we 
          want to record.
          <list>
            <item>As a sibling to <gi>physDesc</gi> add an <gi>additional</gi> element with an <gi>adminInfo</gi> with a <gi>recordHist</gi> with a <gi>source</gi> with a <gi>bibl</gi> inside it. Phew!  This should contain the text of the first paragraph.</item>
            <item>Mark up "Mohlberg Leo Cunibert" as a personal name using the <gi>persName</gi> element, and "1952" as a <gi>date</gi> (optionally use a <att>when</att> attribute on that)</item>
            <item>As a sibling to <gi>adminInfo</gi> add a <gi>listBibl</gi> element with two <gi>bibl</gi> elements in it. Use the text before the semi-colon in the first one, and the text after the semi-colon in the second one.</item>
            <item>Mark "Munding" and "Lehmann" as small capitals by using a <gi>hi</gi> element with a <att>rend</att> attribute of "small-caps".</item>
            <item>
              Basically, turn this:
               <egXML xmlns="http://www.tei-c.org/ns/Examples">
<p>Mohlberg Leo Cunibert, Katalog der Handschriften der Zentralbibliothek Z&#xFC;rich I, Mittelalterliche Handschriften, Z&#xFC;rich 1952, S. 18-19.</p>
<p>Beschr. E. Munding , Das Verzeichnis der St. Galler Heiligenleben und ihrer Handschriften in Cod. Sangall. Nr. 566, in: Texte und Arbeiten I, 3 4 (1918) S. 42 56.; Vgl. P. Lehmann, Mittelalterliche Bibliothekskataloge I (1918) S. 91 99.</p>            
                </egXML>
              into this:<egXML xmlns="http://www.tei-c.org/ns/Examples">
<additional>
  <adminInfo>
    <recordHist>
      <source>
        <bibl>
          <persName>Mohlberg Leo Cunibert</persName> , Katalog der Handschriften der Zentralbibliothek Z&#xFC;rich I, Mittelalterliche Handschriften, Z&#xFC;rich <date>1952</date> , S. 18-19. </bibl>
      </source>
    </recordHist>
  </adminInfo>
  <listBibl>
    <bibl> Beschr. E. <hi rend="small-caps">Munding</hi> , Das Verzeichnis der St. Galler Heiligenleben und ihrer Handschriften in Cod. Sangall. Nr. 566, in: Texte und Arbeiten I, 3 4 (1918) S. 42 56. </bibl>
    <bibl> Vgl. P. <hi rend="small-caps">Lehmann</hi> , Mittelalterliche Bibliothekskataloge I (1918) S. 91 99. </bibl>
  </listBibl>
</additional></egXML>

            </item>
            <item>Delete any bits of punctuation or <gi>p</gi> elements from the original description. Ensure you have a happy green square.</item>
          </list>
          Congratulations! You've encoded a full (and real) manuscript description in TEI!
        </p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Saving Your Work</head>
        <p> Let's save our work: <list>
            <item>Is your work well-formed? Do you have a happy green square or an angry red
              one? If it is an angry red one, make sure you solve any problems before saving!</item>
            <item>Have you formatted and indented your work automatically? </item>
            <item>From the 'File' menu select 'Save' or click on the Save icon (looks like a
              old-style 3.5" disk).</item>
            <item>Or if you prefer use the 'File' then 'Save As' menu item to save the file.</item>
          </list></p>
      </div>
</div>
<?tex \newpage ?>
<div>
        <head>Transcription des lettres</head>
<p xmlns="http://www.tei-c.org/ns/1.0">Dans cet exercice, nous allons nous servir d'oXygen pour la transcription de quelques petites lettres manuscrites.
      </p><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Exemple simple</head>
        <p>Recherchez dans votre dossier Travaux les fichiers <ident>Travaux/vinet.jpg</ident> et
            <ident>Travaux/vinet.xml</ident> : ce dernier etant une version TEI XML preliminaire du
          premier, &#xE0; enrichir</p>
        <list>
          <item>Ajoutez de la structure en vous servant des balises <gi>p</gi> pour les paragraphes,
              <gi>opener</gi> pour les formules initiales, et <gi>closer</gi> pour les formules
            finales; </item>
          <item>ces derniers peuvent contenir <gi>salute</gi> pour les salutations, <gi>signed</gi>
            pour la phrase et le nom de signature, <gi>dateline</gi> pour la date et location. </item>
          <item>Indiquez que <q>Cadinal</q> serait une erreur (avec <gi>sic</gi>)</item>
          <item>Indiquez que <q>par</q> est un ajout (en dessus de ligne) avec <gi>add</gi></item>
          <item>Indiquez les ratures (avec <gi>del</gi>) et fournir ou bien les mots ratur&#xE9;s ou bien
            l'indication <gi>unclear</gi>; supprimez les asterix</item>
          <item>Traitez quelques abr&#xE9;viations avec <gi>expan</gi>, <gi>abbr</gi>, et
            <gi>choice</gi></item>
          <item>indiquez que la phrase <q>apud Medulos</q> est du latin avec la balise <tag>foreign
              xml:lang="lat"</tag></item>
          <item>N'oubliez pas de prendre le cr&#xE9;dit pour vos travaux en modifiant l'ent&#xEA;te!</item>
        </list>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Exemple (un peu) plus moderne</head>
        <p>Dans le meme dossier, vous trouverez une lettre c&#xE9;l&#xE8;bre du G&#xE9;n&#xE9;ral de Gaulle, &#xE0; tra&#xEE;ter
          de la m&#xEA;me facon. </p>
        <list>
          <item>La lettre est sur deux surfaces, numeris&#xE9;s en fichiers
              <ident>appel_recto.jpg</ident> et <ident>appel_verso.jpg</ident>: regardez les
            bien</item>
          <item>Cette lettre est un peu difficile &#xE0; lire, non seulement &#xE0; cause de l'&#xE9;criture
            abominable du g&#xE9;n&#xE9;ral, mais aussi &#xE0; cause de la pr&#xE9;sence de plusieurs ratures,
            corrections, etc.</item>
          <item>Le fichier <ident>appel.xml</ident> contient une premi&#xE8;re esquisse d'encodage,
            mais il n'est pas compl&#xE8;te: notamment en ce qui concerne les corrections, ratures, etc.
            A vous donc de l'am&#xE9;liorer! </item>
          <item>Pour compl&#xE9;ter la transcription, il pourrait &#xEA;tre utile de regarder en compl&#xE9;ment le fichier
            <ident>appel_weiner.gif</ident> : ceci repr&#xE9;sente la version finale de la lettre telle qu'elle a &#xE9;t&#xE9;
            affich&#xE9;e en juin 1940. N&#xE9;anmoins, n'oubliez pas que l'objet de cet exercice est
            d'encoder le manuscrit originel, et non pas l'affiche!</item>
        </list>
      </div>
</div>
<?tex \newpage ?>
<div>
        <head>Balisage s&#xE9;mantique du CCMAA</head>
<div xmlns="http://www.tei-c.org/ns/1.0">
       
        <p>Dans cet exercice, nous allons enrichir le balisage des <title>Exercices</title> du CCMAA
          d&#xE9;ja effectu&#xE9; avec des aspects de caract&#xE8;re plus <soCalled>s&#xE9;mantique</soCalled>, c'est &#xE0;
          dire que nous allons distinguer les noms de personnes et de lieux, et que nous allons aussi
          ajouter des repr&#xE9;sentations normalis&#xE9;es des entit&#xE9;s que nous rep&#xE9;rons dans le
          texte.</p>
        
        <p>Nous supposons que vous avez compl&#xE9;t&#xE9; (plus ou moins) les deux exercices pr&#xE9;cedents, et
          que vous disposez donc d'une version compl&#xE8;te et valide du fichier <ident>pv61.xml</ident>
          (si ce n'est pas le cas, on vous pardonne ! vous trouverez une version corrig&#xE9;e dans le
          fichier <ident>pv61-corr.xml</ident>) </p>
        <p> Nous supposons &#xE9;galement que vous avez en t&#xEA;te une id&#xE9;e assez claire de ce que vous
          consid&#xE9;rez comme un nom de personne ou un nom de lieux etc !</p>
        <list>
          <item>S&#xE9;l&#xE9;ctionnez plusieurs noms dans le texte et balisez-les avec CTRL-E, en vous
            servant de la balise <gi>persName</gi>, <gi>placeName</gi>, <gi>orgName</gi> selon le
            cas.</item><item>Par ex, &#xE0; mon avis, la <code>Direction g&#xE9;n&#xE9;rale des Wakfs</code> est un
              <gi>orgName</gi>, <code>Ahmed bey Sabri</code> est un <gi>persName</gi>, et le
              <code>palais Berdak</code> et <code>Kidjm&#xE2;s el-Ish&#xE2;ki</code> sont tous les deux des
              <gi>placeName</gi>, mais n'&#xE9;tant pas de tout expert dans ce domaine, j'h&#xE9;site &#xE0; me
            prononcer sur des cas plus complexes ! </item>
          <item>Puis, pour chaque <emph>entit&#xE9;</emph> identifi&#xE9;e qui vous int&#xE9;resse, ajoutez un
            &#xE9;l&#xE9;ment (un <gi>org</gi>, un <gi>place</gi>, ou un <gi>person</gi> selon le cas) &#xE0;
            l'ent&#xEA;te, dans un des <gi>listPlace</gi>, <gi>listOrg</gi>, ou <gi>listPerson</gi> que
            vous y avez implant&#xE9; au cours de l'exercice pr&#xE9;c&#xE8;dent</item>
          <item>Faites la liaison entre les noms et l'entit&#xE9; avec un attribut <att>ref</att> sur
            chacun des &#xE9;l&#xE9;ments nominaux, et un attribut <att>xml:id</att> sur l'&#xE9;l&#xE9;ment entit&#xE9;. A
            vous de choisir un syst&#xE8;me de codification pour les valeurs de ces attributs! </item>
          <item>Par exemple: on va baliser chaque mention du palais Berdak (qu'il soit &#xE9;crit
            ainsi, ou avec un q ou en lettres arabes) avec un <tag>placeName ref="#PB1234"</tag> (le
            di&#xE8;se est obligatoire : il indique que cette valeur est un pointeur). Dans l'ent&#xEA;te, on
            va ajouter un seul &#xE9;l&#xE9;ment <tag>place xml:id="PB1234"</tag> vers lequel toutes ces
            r&#xE9;f&#xE9;rences pointent.</item>
          <item>Ensuite, vous pouvez faire des recherches sur internet ou ailleurs pour vous renseigner au sujet des autres entit&#xE9;s r&#xE9;p&#xE9;r&#xE9;es, et ainsi compl&#xE9;ter ces
            &#xE9;l&#xE9;ments avec tout ce qui vous semble pertinent &#xE0; conna&#xEE;tre. Par exemple, pour les
            personnes que vous arrivez &#xE0; identifier, ajouter une date de naissance (<gi>birth</gi>)
            ou de mort (<gi>death</gi>), d'autres noms, des &#xE9;v&#xE9;nements de leur vie (<gi>event </gi>)
            etc. dans le <gi>person</gi> concern&#xE9;. </item>
          <item>Essayez de cr&#xE9;er au moins une douzaine d'entit&#xE9;s ... </item>
        </list>
      </div>
</div>
<?tex \newpage ?>
<div>
        <head>oXygen et ODD</head>
<p xmlns="http://www.tei-c.org/ns/1.0">Dans cet exercice, nous allons explorer l'usage d'oXygen pour : <list>
            <item>installation du TEI add-on</item>
            <item>traitement des fichiers ODD</item>
            <item>la validation continuelle d'un nouveau document</item>
            <item>transformations generiques</item>
          </list>
        </p><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Installation du TEI Framework (Add On) </head>
        <p>Dans un exercice pr&#xE9;c&#xE9;dent vous avez g&#xE9;n&#xE9;r&#xE9; un sch&#xE9;ma &#xE0; partir d'un fichier ODD en
          utilisant l'outil Roma. Mais c'est aussi possible de le faire directement dans oXygen,
       si vous avez bien install&#xE9; le <soCalled>TEI Framework</soCalled> add-on </p>
        <p>Pour v&#xE9;rifier cela, s&#xE9;lectionnez <ident>Preferences</ident> du menu
            <ident>Options</ident>, et cliquez sur Add-ons (deuxi&#xE8;me item du liste). Si tout va
          bien, vous verrez deux URLs dans la table, comme ceci: </p>
        <p><graphic url="../Graphics/addons.png" height="4cm"/></p>
        <p>Si vous en avez besoin, des informations d&#xE9;taill&#xE9;es (mais en anglais) sur l'installation
          du TEI Add On sont disponibles au blog de James Cummings <ptr target="http://blogs.it.ox.ac.uk/jamesc/2014/04/02/auto-update-your-tei-framework-in-oxygen/"/></p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Traitement d'un ODD</head>
        <list>
          <item>Lancez oXygen et ouvrez le fichier <ident>cartes-tei.odd</ident> qui se trouve dans
            votre dossier <ident>Travaux</ident>
          </item>
          <item>Dans le menu <ident>Document</ident> s&#xE9;lectionnez <ident>Transformation</ident> -&gt;
              <ident>Configurer Les Scenarios de Transformation</ident>, ou tapez CTRL-MAJ-C, ou
            cliquez l'ic&#xF4;ne sur la barre d'outils. </item>
          <item>Les transformations possibles sont affich&#xE9;es. D&#xE9;roullez pour trouver celles qui
            concernent les ODD et cochez les cases qui vous interessent, par ex: TEI ODD
            XHTML et TEI ODD to RELAXNG Compact</item>
          <item><graphic url="../Graphics/oxy-scenarios.png" height="7cm"/>
          </item>
          <item>Cliquez sur le bouton <ident>Appliquer Associ&#xE9;(s)</ident> pour lancer les
            transformations.</item>
          <item>Si tout va bien, la sortie XHTML s'affiche dans le navigateur, et la sortie RNC sera
            enregistr&#xE9;e dans un dossier <ident>out</ident>
          </item>
        </list>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Usage du sch&#xE9;ma</head>
        <p>Utilisons le sch&#xE9;ma g&#xE9;n&#xE9;r&#xE9; pour contr&#xF4;ler le balisage de quelques cartes.</p>
        <!-- ous pouvez l'utiliser de deux manieres : si vous commencez a zero, </item>
          <item>Cliquez sur l'icône Nouveau en haut à gauche (ou sélectionnez Nouveau du menu
            Fichier, ou tapez CTRL-N) pour ouvrir la boîte de dialogue Nouveau</item>
          <item>Choisissez <ident>Nouveau Document</ident>, ensuite <ident>Document
            XML</ident></item>
          <item> Cliquez sur le bouton <ident>Personnaliser</ident> en bas. Le dialog Nouveau
            s'affiche.</item>
          <item>Pour specifier l'URL du schéma souhaité le plus simple est de parcourir les fichiers
            locaux. <graphic url="../Graphics/nouveau-custom.png" height="6cm"/></item>
          <item>Retrouver le fichier <ident>teiCartes.rnc</ident> que vous avez créé dans l'étape
            precedente</item>
          <item>Cliquer le bouton <ident>Créer</ident> pour créer un fichier TEI XML</item>
          <item>Le document n'est pas encore valide ... à vous de le corriger! </item>
          <item>Mettez le curseur au sein d'un élément incomplet par ex <gi>body</gi> et tapez un
            chevron pour voir les éléments disponibles à ce point. </item>
        </list>
      </div>
      <div>
        <head> </item>Balisage des cartes</head> </item>-->
        <p>Dans le dossier <ident>cartes</ident> vous trouverez des versions TEI plus ou moins
          incompl&#xE8;tes de cinq cartes postales. Pour chaque carte, le fichier <ident>.xml</ident> (par
          ex <ident>carte-5.xml</ident>) contient une partie d&#xE9;j&#xE0; transcrite, et les deux autres
          fichiers contiennent une image du recto (<ident>carte-5r.png</ident>) et du verso
            (<ident>carte-5v.png</ident>) de la m&#xEA;me carte. </p>
        <p>Choisissez une carte (carte-4 serait la plus simple, carte-5 est presque finie) et
          compl&#xE9;tez son balisage, en vous servant d'oXygen. </p>
        <list>
          <item>Ouvrez le fichier xml avec oXygen. </item>
          <item>Par d&#xE9;faut, oXygen se sert de TEI_all comme sch&#xE9;ma, comme vous avez d&#xE9;j&#xE0; vu.</item>
          <item>Pour utiliser votre nouveau sch&#xE9;ma, il suffit de s&#xE9;lectionner <ident>Schema -&gt;
              S&#xE9;lectionner un sch&#xE9;ma</ident> sur le menu <ident>Document</ident> et puis de naviguer
            jusqu'au fichier <ident>out/cartes-tei.rng</ident></item>
          <item>Assur&#xE9;ment le document n'est pas encore valide ... &#xE0; vous de le corriger! </item>
        </list>
        <p>Enregistrez votre version corrig&#xE9;e dans le m&#xEA;me dossier sous le m&#xEA;me nom : on va
          l'utiliser plus tard. </p>
        <p/>
      </div>
</div>
<?tex \newpage ?>
<div>
        <head>Outils web pour l'affichage des documents TEI </head>
<p xmlns="http://www.tei-c.org/ns/1.0">Dans cet exercice, nous allons exp&#xE9;rimenter deux syst&#xE8;mes modestes pour afficher les
      documents TEI XML sur le web.
      </p><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>TEI Boilerplate</head>
        <p>Il s'agit d'un outil &#xE9;labor&#xE9; par John Walsh de l'Universit&#xE9;
          d'Indiana sous le nom de TEI Boilerplate. Vous pouvez le t&#xE9;l&#xE9;charger du site <ptr target="http://teiboilerplate.org"/>, o&#xF9; vous trouverez &#xE9;galement des renseignements sur
          la motivation et les particularit&#xE9;s de ce projet si cela vous interesse (en anglais,
          seulement). </p>
        <list>
          <item>T&#xE9;l&#xE9;chargez le fichier <ident>TEI-Boilerplate.zip</ident> sur votre bureau ou
            ailleurs  </item>
          <item>Apr&#xE8;s avoir d&#xE9;zipp&#xE9; l'archive quelque part (peu importe o&#xF9;), vous aurez un dossier
              <ident>TEI-Boilerplate-master</ident>, qui contient entre autre un dossier
              <ident>content</ident>. Il faut copier tous les fichiers que vous souhaitez afficher
            avec TEI Boilerplate dans ce dossier. </item>
          <item>Pour faire fonctionner Boilerplate, il faut aussi ajouter au d&#xE9;but des fichiers un
              <term>processing instruction</term></item>
        </list>
        <p>Nous ne disposons pas d'un serveur web, mais la m&#xEA;me d&#xE9;marche serait n&#xE9;cessaire en ce
          cas. L'int&#xE9;r&#xEA;t principal de TEI Boilerplate (&#xE0; part sa simplicit&#xE9;) est qu'il vous permet
          de contr&#xF4;ler directement l'affichage des parties de votre document en associant des
          stylages CSS avec ces &#xE9;l&#xE9;ments TEI, sans n&#xE9;cessit&#xE9; de conversion HTML interm&#xE9;diaire. </p>
        <list>
          <item>R&#xE9;ouvrez un de vos fichiers bien balis&#xE9;s, ou bien le fichier
              <ident>pv61-corr.xml</ident> avec oXygen</item>
          <item>Ins&#xE9;rez au d&#xE9;but de fichier cette formule magique <code> &lt;?xml-stylesheet
              type="text/xsl" href="teibp.xsl"?&gt; </code></item>
          <item>Enregistrez cette version du fichier dans le dossier <ident>content</ident></item>
          <item>Si vous souhaitez les afficher, il faut aussi copier les fichiers images
              <ident>pv61_07.png</ident> etc. dans ce m&#xEA;me dossier.</item>
          <item>Lancez votre navigateur web pr&#xE9;f&#xE9;re (chrome, firefox, explorer ...) et 
            retrouvez l'option qui permet d'ouvrir un fichier local (pour firefox, cette option se trouve sur
            le menu <ident>Fichier</ident>)</item>
          <item>Naviguez jusqu'au fichier modifi&#xE9; que vous venez d'enregistrez dans le dossier
              <ident>content</ident> et ouvrez-le</item>
        </list>
        <p>Joli, hein? Si vous avez bien fait, les pages images sont disponibles en parall&#xE8;le, en
          cliquant sur l'ic&#xF4;ne &#xE0; droite de l'&#xE9;cran. Mais par d&#xE9;faut, la pr&#xE9;sence des noms de
          personnes, de lieux, etc. n'est pas signal&#xE9;e. Nous allons r&#xE9;gler cela en ajoutant des
          sp&#xE9;cifications &#xE0; l'ent&#xEA;te.</p>
        <list>
          <item>Revenez dans votre fichier XML en oXygen</item>
          <item>Mettez le curseur juste apr&#xE8;s la balise fermante du <gi>fileDesc</gi></item>
          <item>S&#xE9;lectionnez <ident>Fichier -&gt; Ins&#xE9;rer un fichier</ident> dans le menu
              <ident>Document</ident> et ins&#xE9;rez le fichier <ident>renditions.xml</ident> que vous
            trouvez dans votre dossier <ident>Travaux</ident></item>
          <item>N'oubliez pas d'enregistrer cette nouvelle version de votre fichier au bon
            endroit. </item>
          <item>Rechargez le fichier dans votre navigateur. Cest mieux?</item>
        </list>
        <p>Comment est-ce que cela marche? L'&#xE9;l&#xE9;ment <gi>tagsDecl</gi> (d&#xE9;claration de balises) que
          vous venez d'ajouter contient deux parties. D'abord, il y a une s&#xE9;rie de d&#xE9;clarations
          comme par exemple <egXML xmlns="http://www.tei-c.org/ns/Examples">
            <rendition xml:id="blue" scheme="css"> color:blue; </rendition></egXML> Chacune de ces
          d&#xE9;clarations d&#xE9;finit un style d'affichage. En ce cas, le style porte l'identifiant
            <code>blue</code>. Le style concern&#xE9; est exprim&#xE9; en langue CSS (une langue standard W3C
          pour la d&#xE9;finition des styles). Par exemple, le style <code>blue</code> va afficher du
          texte bleu, le style <code>i</code> va afficher du texte en italique etc.</p>
        <p>En dessous, il y an un &#xE9;l&#xE9;ment <gi>namespace</gi> qui contient une s&#xE9;rie de d&#xE9;clarations
          comme ceci: <egXML xmlns="http://www.tei-c.org/ns/Examples">
            <namespace name="http://www.tei-c.org/ns/1.0">
              <tagUsage gi="placeName" render="#blue"/>
              <tagUsage gi="orgName" render="#i #blue"/> ...</namespace></egXML>
        </p>
        <p>Ces d&#xE9;clarations servent &#xE0; sp&#xE9;cifier que toute occurrence de l'&#xE9;l&#xE9;ment <gi>placeName</gi>
          sera affich&#xE9;e (par d&#xE9;faut) en bleu (plus pr&#xE9;cisement, avec le style identifi&#xE9; par
            <code>blue</code>) : d'ailleurs tout occurrence de <gi>orgName</gi> sera affich&#xE9; en bleu
          et aussi en italique. </p>
        <p>Si par contre vous souhaitez modifier l'affichage d'un seul &#xE9;l&#xE9;ment dans votre document,
          vous pouvez l'indiquer en utilisant l'attribut <att>rendition</att> pour pointer sur le
          style concern&#xE9;. Essayez, par exemple, de faire en sorte que le deuxi&#xE8;me item soit affich&#xE9;
          en italique: il suffit de modifier sa balise ouvrante ainsi : <code>&lt;item n="2"
            rendition="#i"&gt;</code></p>
        <p>Continuez vos explorations... Vous trouverez dans le fichier <ident>teibp.xml</ident> une
          liste plus compl&#xE8;te des styles ce dont vous pourriez vous servir.</p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Extraction de donn&#xE9;es avec une feuille de style XSLT</head>
        <p>TEI Boilerplate nous propose l'affichage de nos documents XML mais il est moins bien
          adapt&#xE9; pour en extraire de donn&#xE9;es ou pour les enrichir. Par contre, une feuille de style
          XSLT nous permettrait d'extraire des donn&#xE9;es, de r&#xE9;organiser, ou d'enrichir un document
          sans probl&#xE8;me. Dans cette deuxi&#xE8;me partie de l'exercice nous proposons d'afficher une
          liste des personnes mentionn&#xE9;es dans le document, s&#xE9;paramment du document lui m&#xEA;me, en
          nous servant d'une feuille de style d&#xE9;j&#xE0; disponible. </p>
        <p>D'abord il faut indiquer o&#xF9; dans notre document nous souhaitons voir la liste g&#xE9;n&#xE9;r&#xE9;e. <list>
            <item>Rouvrez votre document XML TEI avec oXygen (la version originelle, non pas celle que vous venez de modifier pour Boilerplate)</item>
            <item>Ins&#xE9;rez un &#xE9;l&#xE9;ment <gi>front</gi> comme premier composant de l'&#xE9;l&#xE9;ment
                <gi>text</gi> (i.e. <emph>avant</emph> le d&#xE9;but de l'&#xE9;l&#xE9;ment <gi>body</gi>) si votre
              document ne contient pas encore cet &#xE9;l&#xE9;ment</item>
            <item>Au sein de cet &#xE9;l&#xE9;ment <gi>front</gi>, ins&#xE9;rez un &#xE9;l&#xE9;ment <gi>divGen</gi> de type
                <code>namelist</code></item>
            <item>Ainsi <egXML xmlns="http://www.tei-c.org/ns/Examples">
                <front><divGen type="namelist"/></front>
              </egXML></item>
            <item>N'oubliez pas d'enregistrer le fichier!</item>
          </list></p>
        <p>Nous avons besoin d'une transformation XSLT qui va retrouver tous les noms de
          personnes r&#xE9;f&#xE9;renc&#xE9;s dans le document, les trier par ordre alphab&#xE9;tique, &#xE9;liminer les
          doublons, et enfin afficher une liste bien stylis&#xE9;e &#xE0; l'endroit o&#xF9; nous avons ins&#xE9;r&#xE9;
          l'&#xE9;l&#xE9;ment <gi>divGen</gi>. Cette transformation doit &#xE9;galement transformer la suite du
          document en HTML. C'est un emploi classique des TEI Stylesheets -- et en effet on l'a d&#xE9;j&#xE0;
          effectu&#xE9; pour un projet francais qui concerne l'archive de l'OuLiPo. Ce stylesheet
          est donc d&#xE9;j&#xE0; accessible ce qui simplifie beaucoup notre d&#xE9;marche...</p>
        <list>
          <item>Dans votre browser, visitez <ptr target="www.tei-c.org/oxgarage/"/></item>
          <item>S&#xE9;lectionnez TEI P5 XML comme format de saisi (input format) et XHTML comme format
            de sortie (output format)</item>
          <item>Naviguez jusqu'au fichier que vous venez de modifier dans l'&#xE9;tape pr&#xE9;c&#xE9;dente, et 
            s&#xE9;lectionnez-le</item>
          <item>Avant de cliquer sur le bouton <ident>Convert</ident>, cliquez <ident>Show advanced
              options</ident></item>
          <item>S&#xE9;lectionnez <ident>oulipo</ident> dans la liste des profiles qui s'affiche</item>
          <item>Ensuite, cliquez sur <ident>Convert</ident> et patientez ... </item>
          <item>Enregistrez le fichier HTML envoy&#xE9; par oxGarage quelquepart sur votre bureau </item>
      <!--  </list>
        <p><graphic url="../Graphics/saveOutput.png" height="11cm"/>(Ceci est le dialog de Firefox:
          d'autres navigateurs peuvent se comporter d'autres manières)</p>
        <list>-->
          <item>Ouvrez ce fichier avec votre navigateur et regardez le joli <hi>index nominorum</hi>
            g&#xE9;n&#xE9;r&#xE9; au d&#xE9;but du fichier. </item>
        </list>
        <p>Enfin, nous vous invitons de consid&#xE9;rer les questions suivantes : <list>
            <item>Quelles modifications souhaiterez vous apporter &#xE0; l'affichage de votre document? </item>
            <item>Est-ce que ces modifications n&#xE9;cessiteraient des modifications &#xE0; l'encodage XML de
              votre document?</item>
            <item>Quels sont les (d&#xE9;s)avantages de ces deux m&#xE9;thodes? (affichage direct comme
              Boilerplate vs. transformation en HTML)</item>
          </list>
        </p><p>S'il vous reste du temps, essayez d'afficher une (ou plusieurs) de vos cartes postales avec Boilerplate! </p>
      </div>
</div>
<?tex \newpage ?>
<div>
        <head>Un peu de XPath, un peu de XSLT</head>
<p xmlns="http://www.tei-c.org/ns/1.0">L'objectif de cet exercice est de vous fournir un go&#xFB;t de ce qui est possible avec XSLT </p><p xmlns="http://www.tei-c.org/ns/1.0">Nous prenons comme
        exemplaire une version numeris&#xE9;e d'un sonnet c&#xE9;l&#xE8;bre de
        DuBellay. Vous le trouverez dans le fichier <ident>duBellay.xml</ident>  de votre dossier <ident>Travaux</ident>  &#x2014; ouvrez-le d'abord
        avec Oxygen.</p><figure xmlns="http://www.tei-c.org/ns/1.0"><graphic url="../Graphics/duBellay.png"/></figure><div xmlns="http://www.tei-c.org/ns/1.0"><head>Exploration avec XPath</head>

     
        <p>Pour voir un peu ce que l&#x2019;utilisation de XPath tout seul
        peut apporter &#xE0; un processus d&#x2019;exploration, d&#x2019;appropriation ou
        de v&#xE9;rification de document TEI, oXygen est tr&#xE8;s pratique. La
        ligne de saisie "XPath" que l&#x2019;on voit a gauche en haut de la fen&#xEA;tre,
        au-dessous des barres d&#x2019;outils oXygen, permet de saisir des
        expressions XPath. Une fois tap&#xE9; "Entr&#xE9;e" au clavier, oXygen
        &#xE9;value l&#x2019;expression et retourne, dans la fen&#xEA;tre qui fait
        toute la largeur de l&#x2019;&#xE9;cran en bas, une liste de(s)
        r&#xE9;sultat(s) - un ou plusieurs ensembles de n&#x153;uds, en donnant
        pour chaque n&#x153;ud r&#xE9;sultat l&#x2019;expression XPath qui permet de
        l&#x2019;atteindre. Si on clique avec la souris sur une des lignes de
        r&#xE9;sultat, oXygen montre dans la fen&#xEA;tre de saisie le n&#x153;ud
        r&#xE9;sultat, dans son contexte TEI.</p>
        <!--p><graphic url="XPath-tool.jpg" height="200px"/></p-->
        <p>Voici une petite liste de requ&#xEA;tes que vous devriez essayer d&#x2019;exprimer au moyen du
          langage XPath&#xA0;: <list type="ordered">
            <item>quel est l&#x2019;&#xE9;l&#xE9;ment racine du fichier XML&#xA0;?</item>
            <item>quel est le titre donn&#xE9; &#xE0; ce fichier&#xA0;?</item>
            <item>qui est le responsable de la cr&#xE9;ation du fichier&#xA0;?</item>
	    <item>quelle est l'origine de la version encod&#xE9;e&#xA0;?</item>
<item>quelle est la date de la r&#xE9;vision la plus r&#xE9;cente du fichier ?</item>
        <item>combien y a-t-il de strophes (<gi>lg</gi>) dans le sonnet ?</item>
            <item>combien y a-t-il de segments de texte dont la
	    graphie est consid&#xE9;r&#xE9;e incorrecte aujourd'hui ?</item>
<item>combien y a-t-il de vers (<gi>l</gi>) qui contient au moins un
tel segment ?</item>
            <item>quel est le contenu textuel du premier vers de
	    chaque strophe  ? et du dernier? </item>
            <item>Quels  noeuds texte contiennent la cha&#xEE;ne de caract&#xE8;res "jamais"</item>
          </list></p>
        <p>On va faire ces exercices ensemble. Des r&#xE9;ponses sont
	propos&#xE9;es dans la section qui suit : ne les regardez pas si vous
	pr&#xE9;f&#xE8;rez tester vos comp&#xE9;tences!</p>
        <!--p>Nota : utiliser ici XPath 2.0 (à cause de l’espace de noms par défaut).</p-->
      </div><div xmlns="http://www.tei-c.org/ns/1.0">

<head> Exercice XPath corrig&#xE9;</head>

<list type="gloss">
<label>Quel est l&#x2019;&#xE9;l&#xE9;ment racine du fichier XML&#xA0;?</label>
<item><p>Expression XPath &#xE0; &#xE9;crire : </p><p><code>/*</code> [le noeud document est d&#xE9;sign&#xE9; par le slash ; la 2e &#xE9;tape d&#xE9;signe les enfants de type &#xE9;l&#xE9;ment de ce noeud]</p>
<p>R&#xE9;ponse : TEI </p></item>

<label>Quel est le titre donn&#xE9; &#xE0; ce fichier&#xA0;?</label>
<item><p>Expression XPath &#xE0; &#xE9;crire : </p><p><code>/TEI/teiHeader/fileDesc/titleStmt/title</code> ou encore (entre autres possibilit&#xE9;s) : <code>//titleStmt/title</code></p>
<p>R&#xE9;ponse : On voit les deux noeuds <gi>title</gi> qui r&#xE9;pondent &#xE0; la
question. Si on voulait obtenir le titre proprement dit (sans le
compl&#xE9;ment de titre), il faudrait conna&#xEE;tre pr&#xE9;cis&#xE9;ment le mod&#xE8;le
auquel ob&#xE9;it ce document, et demander le noeud title en premi&#xE8;re
position (//titleStmt/title[1]), ou de choisir le noeud title dont
l'attribut <att>type</att> porte une valeur appropriee (<code>//titleStmt/title[@type='main')]</code>).
</p></item>

<label>Qui est le responsable de la cr&#xE9;ation du fichier&#xA0;?</label>
<item><p>Expression XPath &#xE0; &#xE9;crire : </p><p><code> //titleStmt/respStmt/name</code></p>
<p>R&#xE9;ponse : un seul noeud ici.</p>
</item>

<label>Quelle est l'origine de la version encod&#xE9;e&#xA0;?</label>
<item><p>Expression XPath &#xE0; &#xE9;crire : </p><p><code>//sourceDesc/*</code> ou,
plus finement, <code>/TEI/fileDesc/sourceDesc/*</code>. Sans le
<code>*</code> vous ne recevrez que l'&#xE9;l&#xE9;ment de groupement 
<gi>sourceDesc</gi>, sans ses composants.</p></item>

<label>Quelle est la date de la r&#xE9;vision la plus r&#xE9;cente du fichier
?</label>
<item><p>Expression XPath &#xE0; &#xE9;crire :</p><p>
<code>revisionDesc/change[1]/@when</code>. Par d&#xE9;faut, le premier
<gi>change</gi> devrait etre le plus r&#xE9;cent, et son attribut
<att>when</att> donnera
sa date dans un format normalis&#xE9;.</p> 
<p>R&#xE9;ponse : 2011-05-23 </p></item>

<label>Combien y a-t-il de strophes dans le sonnet ? </label>
<item><p>Expression XPath &#xE0; &#xE9;crire : </p><p><code>count(//lg)</code>. On se sert
de la fonction <code>count()</code>.</p>
<p>R&#xE9;ponse : 4 </p></item>


<label>Combien y a-t-il de segments de texte dont la graphie est consid&#xE9;r&#xE9;e incorrecte aujourd'hui ?</label>
<item><p>Expression XPath &#xE0; &#xE9;crire : </p><p>
<code>count(/TEI/text//orig)</code>. Enlevez le <code>count()</code>
si vous pr&#xE9;f&#xE9;riez les voir...</p>
<p>R&#xE9;ponse : 17</p></item>
 
<label>Combien y a-t-il de vers qui contient au moins un tel segment?</label>
<item><p>Expression XPath &#xE0; &#xE9;crire : </p><p><code>count(//l[orig])</code></p>
<p>R&#xE9;ponse : 7</p>
</item>

<label>Quel est le contenu textuel du premier vers de chaque strophe
? et du dernier?</label>
<item><p>Expression XPath &#xE0; &#xE9;crire :</p><p>
<code>//lg/l[1]//text()</code></p>
<p>Pour le dernier, c'est un peu moins
&#xE9;vident... <code>//lg/l[position()=last()]//text()</code>
</p>
</item>

<label>Quels  noeuds texte contiennent la cha&#xEE;ne de caract&#xE8;res
"jamais" ?</label>
<item><p>Expression XPath &#xE0; &#xE9;crire : </p><p><code>//text()[contains(., 'jamais')]</code></p>
<p>R&#xE9;ponse : la liste de r&#xE9;ponses contient 2 noeuds</p>
</item>

</list></div><div xmlns="http://www.tei-c.org/ns/1.0"><head>Transformation en HTML</head>

        <p>L'application classique de XSLT est de transformer un document TEI XML en HTML pour le
          visualiser dans un navigateur web. On commence donc par
	l&#xE0;. </p>
<p>D'abord il faut mettre en place une liaison entre le
	fichier XML d'entr&#xE9;e, le fichier HTML de sortie, et le fichier
	XSLT qui va contr&#xF4;ler la transformation. Cette liaison
s'appele un <term>sc&#xE9;nario de transformation</term> et on le configure
sous Oxygen de la mani&#xE8;re suivante:</p>

        <list type="ordered">
          <item> Ouvrez Oxygen. S&#xE9;lectionnez <ident>Ouvrir</ident> sur le menu
              <ident>Fichier</ident> et ouvrez le fichier
	      <ident>duBellayEd.xml</ident> qui se trouve dans votre dossier <ident>Travaux</ident>.</item>

          <item>Dans le menu <ident>Document</ident> s&#xE9;lectionnez <ident>Transformation</ident>, et
            ensuite <ident>Configurer un sc&#xE9;nario de transformation</ident> ou tapez
              <code>ctrl-maj-C</code>, ou bien cliquez sur le bouton &#xE0; droite du triangle rouge sur
            la barre d'outils.</item>
        </list>
        <p>Cliquez d'abord sur <ident>nouveau</ident> pour ouvrir la bo&#xEE;te de dialogue
            <ident>Nouveau Sc&#xE9;nario</ident>.</p>
        <p><graphic height="5cm" url="../Graphics/scenario-2.png"/></p>
        <list>
          <item>Tapez <code>duBellay.xsl</code> dans le champ <ident>XSL URL</ident>.</item>
          <item>Cliquez sur l'onglet <code>Sortie</code>
          </item>
          <item>Tapez <code>output.html</code> dans le champ <code>Enregistrer sous</code>
          </item>
          <item>Cochez la case <code>Ouvrir dans un navigateur</code></item>
          <item>Cliquez sur <code>Accepter</code></item>
        </list>
        <p>Vous avez maintenant cr&#xE9;&#xE9; un nouveau sc&#xE9;nario de transformation, qui s'appelle
            <ident>duBellayEd</ident>.</p>
        <p>
          <graphic height="5cm" url="../Graphics/scenario-4.png"/></p>
        <list>
          <item>Cliquez sur <code>Transformer maintenant</code></item>
          <item>En bas de l'&#xE9;cran, le message <code>Transformation r&#xE9;ussie</code> appara&#xEE;t... </item>
          <item>.. et apr&#xE8;s un bref d&#xE9;lai, votre navigateur devrait s'ouvrir pour afficher le
            fichier <ident>output.html</ident> que vous venez de cr&#xE9;er.</item>
          <item>C'est joli, hein ? Peut-&#xEA;tre y a-t-il encore un peu de travail &#xE0; faire...</item>
        </list>

      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Une feuille de style XSLT</head>
        <p>Une feuille de style XSLT est un document XML. Il peut donc &#xEA;tre &#xE9;dit&#xE9; avec Oxygen. <list>
            <item>Allez de nouveau sur <ident>Fichier - Ouvrir</ident>. Ouvrez le fichier
                <ident>duBellay.xsl</ident> dans votre dossier de travail.</item>
            <item>Ce fichier XSLT contient un seul template, qui correspond &#xE0; l'&#xE9;l&#xE9;ment
              <gi>TEI</gi>, l'&#xE9;l&#xE9;ment racine de notre document. Son effet sera de produire les
              balises <gi>html</gi> et <tag>/html</tag>, avec entre les deux le r&#xE9;sultat du
                <gi>xsl:apply-templates</gi></item>
            <item>Ce dernier va essayer d'appliquer tous les templates disponibles... il n'y en a
              pas, donc il ne va produire que le texte du document. </item>
            <item>... et en effet, si vous revenez sur votre navigateur et regardez la source du
              fichier, c'est ce qu'il a fait.</item>
          </list></p>

        <p>Au travail ! D'abord, nous allons extraire de l'en-t&#xEA;te un titre pour le document HTML, et
          supprimer le reste du TEI Header.</p>

        <list>
          <item>Apr&#xE8;s le <gi>html</gi>, tapez <code>&lt;head&gt;</code></item>
          <item>Oxygen ajoute la balise fermante. C'est bien. Continuez donc. Ajoutez
            <code>&lt;title&gt;</code> &#xE0; l'int&#xE9;rieur de l'&#xE9;l&#xE9;ment <gi>head</gi>. Pour trouver le titre du document,  il faut naviguer de la
            racine du document (l'&#xE9;l&#xE9;ment TEI) jusqu'&#xE0; l'&#xE9;l&#xE9;ment <gi>title</gi>, qui se trouve dans
            le <gi>titleStmt</gi>, dans le <gi>fileDesc</gi>, dans le <gi>teiHeader</gi>. Cela
            s'effectue avec le <term>XPath</term> suivant.</item>
          <item>Tapez <code>&lt;xsl:value-of select="teiHeader/fileDesc/titleStmt/title"/&gt;</code>.</item>
          <item>Modifiez la balise <gi>xsl:apply-templates</gi>, en ajoutant <code>
              select="text"</code> et entourez-la d'un &#xE9;l&#xE9;ment HTML <gi>body</gi></item>
          <item>Cliquez sur le bouton Indentation. Votre feuille de style maintenant devrait
            ressembler &#xE0; ceci :</item>
        </list>
        <p><graphic height="8cm" url="../Graphics/script-1.png"/></p>
        <list>
          <item>Cliquez sur l'ic&#xF4;ne de la disquette (ou tapez ctrl-s) pour enregistrer les
            modifications que vous venez de faire.</item>
          <item>Cliquez sur l'onglet <ident>duBellayEd.xml</ident> pour revenir sur votre document
            XML.</item>
          <item>Cliquez sur l'ic&#xF4;ne triangle-rouge pour relancer la transformation (ou tapez
            CTRL-maj-T)</item>
          <item>Voyons ce que cela donne : cette fois, on ne voit que le <gi>text</gi> de notre
            document. On fait des progr&#xE8;s !</item>
        </list>

        <p>Maintenant, on va ajouter des templates.</p>

        <list>
          <item>Revenez sur la feuille de style. </item>
          <item>Ajoutez <list>
              <item>un template pour <gi>l</gi>, qui va ajouter une balise <tag>br/</tag> apr&#xE8;s chaque
                vers</item>
              <item>un template pour <gi>head</gi>, qui va l'entourer de <gi>h2</gi>
              </item>
              <item>un template pour <gi>lg</gi>, qui va l'entourer de <gi>p</gi>, et en plus le
                pr&#xE9;fixer du nombre de chaque strophe.</item>
            </list></item>
          <item>Voici les templates requis... essayez de comprendre par vous-m&#xEA;me le fonctionnement de
            chacun d'entre eux. </item>
        </list>
        <p><graphic height="8cm" url="../Graphics/script-2.png"/>
        </p>
      </div><div xmlns="http://www.tei-c.org/ns/1.0">
        <head>Traitement des <gi>choice</gi></head>
        <p>Est-ce que le XSLT peut nous aider &#xE0; mieux traiter ces
	&#xE9;l&#xE9;ments <gi>choice</gi>? Bien sur, oui. D'abord,  on pourrait simplement
          ajouter un template qui va supprimer les <gi>orig</gi> (ou
	les <gi>reg</gi> si vous le pr&#xE9;f&#xE9;riez).</p>
        <p>Tout ce qu'il faut, c'est ajouter un template comme ceci : <tag>xsl:template
            match="orig"/</tag>. Essayez-le. Est-ce que vous comprenez comment cela fonctionne ? Si oui,
          vous avez bien compris les principes de XSLT !</p>

      </div><div xmlns="http://www.tei-c.org/ns/1.0"><head>Pour aller plus loin...</head>
<list>
<item>Cr&#xE9;ez un param&#xE8;tre <ident>modernisation</ident> avec
<gi>xsl:variable</gi>, avec comme valeur "oui" ou "non", selon votre
pr&#xE9;f&#xE9;rence. (Attention &#xE0; ne pas introduire des blancs autour du mot !). Ceci va
contr&#xF4;ler
la suppression ou bien des <gi>reg</gi>, ou bien des
<gi>orig</gi> selon la valeur qu'on lui donne. Par exemple, s'il aura
la valeur <code>oui</code> on supprimera les <gi>orig</gi>. </item>
<item>Ajouter un template pour l'&#xE9;l&#xE9;ment <gi>choice</gi>, qui contiendra un <gi>xsl:choose</gi> pour tester la valeur de ce
param&#xE8;tre </item>
<item>Les experts en HTML peuvent proposer d'autre mises &#xE0; jour
eventuelles pour les <gi>choice</gi>, sous contr&#xF4;le d'autre valeur du param&#xE8;tre... </item>
</list>

<p>Qu'est-ce qu'on ferait pour n'afficher qu'une partie du texte?
Modifiez votre feuille de style pour n'afficher que le vers initial de
chaque strophe. Ensuite, vous pourriez les trier par
ordre alphab&#xE9;tique....</p>

<p>Vous trouverez dans le fichier <ident>duBellayCorr.xsl</ident> une
version corrig&#xE9;e de cet exercice... ne le regardez pas tout de
suite!</p>

</div>
</div>
<?tex \newpage ?>
<?tex \newpage ?>
      <div>
        <head>Suggestions de lectures compl&#xE9;mentaires</head>
        <p>Le <ref target="http//www.tei-c.org">site TEI</ref>
        maintient une page de liens sur des mat&#xE9;riaux p&#xE9;dagogiques &#xE0;
        <ptr target="http://www.tei-c.org/Support/Learn/tutorials.xml"/>;
        de laquelle nous avons s&#xE9;l&#xE9;ctionn&#xE9;  quelques-uns ci-dessous.</p>
        <p>Les <ref target="http://www.tei-c.org/P5/">TEI
        Guidelines</ref> contient &#xE9;galement une grande liste de r&#xE9;f&#xE9;rences sur
        la th&#xE9;orie de balisage et la pratique de la TEI &#xE0; <ptr target="http://www.tei-c.org/release/doc/tei-p5-doc/en/html/BIB.html#BIB-RDG"/>,
        de laquelle nous avons s&#xE9;lectionn&#xE9; quelques-unes d'interet g&#xE9;n&#xE9;ral. </p>
        <p>Il existe d'ailleurs deux collections de citations
         TEI sur le site Zotero : l'un plus g&#xE9;n&#xE9;rique &#xE0; <ptr target="https://www.zotero.org/groups/tei/items"/>, et
        l'autre plus focalis&#xE9; sur le linguistique &#xE0; <ptr target="https://www.zotero.org/groups/tei-lingsig/items/"/>
        </p>
        <div>
          <head>Tutorial articles and manuals</head>
          <listBibl>
            <bibl xml:id="Bertrand">
              <editor>
                <forename>Lauranne</forename>
                <surname>Bertrand</surname>
              </editor>
              <editor>
                <forename>Marie Luce</forename>
                <surname>Demonet</surname>
              </editor>
              <editor>
                <forename>Jorge</forename>
                <surname>Fins</surname>
              </editor>
              <title level="m">Manuel d&#x2019;encodage XML-TEI Renaissance et temps modernes (Imprim&#xE9;s - manuscrits)</title>
              <ptr target="http://www.bvh.univ-tours.fr/XML-TEI/index.asp"/>
              <note>Detailed encoding manual for early print materials; in French.</note>
            </bibl>
<!--            <bibl xml:id="Bingenheimer2009">
              <editor>
                <forename>Marcus</forename>
                <surname>Bingenheimer</surname>
              </editor>
              <title level="m" xml:lang="zh">TEI使用指南──運用TEI處理中 文文獻</title>
              <title level="m" xml:lang="zh">Chinese TEI – A guide to using TEI with Chinese texts</title>
              <pubPlace>Taiwan</pubPlace>
              <publisher>Taiwan E-learning and Digital Archive Program 數位典藏與數位學習國家型科技計畫</publisher>
              <date>2009</date>
              <ptr target="http://www.tei-c.org/Support/Learn/TEI-ChinLoc-2ndPrintEd.pdf"/>
              <note>Chinese translation of the TEI tutorial (P5 edition) and accompanying articles. </note>
            </bibl>
    -->        <bibl xml:id="Bodard">
              <editor>
                <forename>Gabriel</forename>
                <surname>Bodard</surname>
              </editor>
              <editor>
                <forename>Tom</forename>
                <surname>Elliott</surname>
              </editor>
              <editor>
                <forename>Elli</forename>
                <surname>Mylonas</surname>
              </editor>
              <title level="m">EpiDoc Guidelines: Ancient documents in TEI XML</title>
              <ptr target="http://www.stoa.org/epidoc/gl/latest/"/>
              <note>Detailed encoding manual for epigraphical and other ancient primary source materials.</note>
            </bibl>
            <bibl xml:id="BurnardSperberg">
              <author>
                <forename>Lou</forename>
                <surname>Burnard</surname>
              </author>
              <author>
                <forename>C.M.</forename>
                <surname>Sperberg-McQueen</surname>
              </author>
              <title level="m">TEI Lite: Encoding for Interchange: an introduction to the TEI: final revised edition for
                TEI P5</title>
              <ptr target="http://www.tei-c.org/release/doc/tei-p5-exemplars/html/tei_lite.doc.html"/>
              <date>August 2012</date>
              <note>The original one stop generic tutorial introduction to using the TEI. Also available in <ref target="http://www.tei-c.org/release/doc/tei-p5-exemplars/html/tei_lite_fr.doc.html">a French
                  translation by Sophie David and Lou Burnard.</ref></note>
            </bibl>
            <bibl xml:id="Ciottied2005">
              <editor>
                <forename>Fabio</forename>
                <surname>Ciotti</surname>
              </editor>
              <title level="m" xml:lang="fr">Il Manuale TEI Lite: Introduzione Alla Codifica Elettronica Dei Testi
                Letterari</title>
              <pubPlace>Milano</pubPlace>
              <publisher>Sylvestre Bonnard</publisher>
              <date>2005</date>
              <note>Italian translation of the TEI tutorial (P4 edition); accompanied by introductory articles on XML,
                on the transition from P4 to P5, and on TEI tools and techniques. </note>
            </bibl>
            <bibl xml:id="Dalmau">
              <editor>
                <forename>Michelle</forename>
                <surname>Dalmau</surname>
              </editor>
              <editor>
                <forename>Kevin</forename>
                <surname>Hawkins</surname>
              </editor>
              <title level="m">Best Practices for TEI in Libraries</title>
              <ptr target="http://purl.oclc.org/NET/teiinlibraries"/>
              <note>Detailed specification of a subset of TEI appropriate for use in capture of primary sources for
                digital library work.</note>
            </bibl>
            <bibl xml:id="Flanders">
              <editor>
                <forename>Julia</forename>
                <surname>Flanders</surname>
              </editor>
              <editor>
                <forename>Syd</forename>
                <surname>Bauman</surname>
              </editor>
              <title level="m">Women Writers Project Guide to Scholarly Text Encoding</title>
              <ptr target="http://www.wwp.brown.edu/research/publications/guide/"/>
              <date>2007</date>
              <note>Website providing documentation and guidance on using the TEI for the encoding of early printed
                books.</note>
            </bibl>
            <bibl xml:id="HawkinsIntro">
              <author>
                <forename>Kevin</forename>
                <surname>Hawkins</surname>
              </author>
              <title level="m">Introduction to XML for Text</title>
              <ptr target="www.ultraslavonic.info/intro-to-xml"/>
              <note>Short introduction to encoding with XML for absolute beginners.</note>
            </bibl>
            <bibl xml:id="Loiseau2002">
              <author>
                <forename>Sylvain</forename>
                <surname>Loiseau</surname>
              </author>
              <title level="m">Les standards : autour d'XML et de la TEI</title>
              <ptr target="http://www.revue-texto.net/Corpus/Manufacture/standards/sommaire.html"/>
              <date>2002</date>
              <note>Detailed overview of TEI P4 and related XML standards; in French.</note>
            </bibl>
            <bibl xml:id="VanDen">
              <editor>
                <forename>Ron</forename>
                <surname>Van den Branden</surname>
              </editor>
              <editor>
                <forename>Edward</forename>
                <surname>Vanhoutte</surname>
              </editor>
              <title level="m">TEI By Example</title>
              <ptr target="http://www.teibyexample.org"/>
              <note>Online tutorial site providing practical exercises and examples for the full range of TEI (P4)
                modules.</note>
            </bibl>
          </listBibl>
        </div>
        <div>
          <head>Journal articles and books</head>
          <listBibl>
            <biblStruct xml:id="Barnardetal1996">
              <analytic>
                <author>
                  <forename>David</forename>
                  <forename>T.</forename>
                  <surname>Barnard</surname>
                </author>
                <author>
                  <forename>Lou</forename>
                  <surname>Burnard</surname>
                </author>
                <author>
                  <forename>C.</forename>
                  <forename>Michael</forename>
                  <surname>Sperberg-McQueen</surname>
                </author>
                <title level="a">Lessons learned from using SGML in the Text Encoding Initiative</title>
              </analytic>
              <monogr>
                <title level="j">Computer Standards &amp; Interfaces</title>
                <imprint>
                  <biblScope type="vol">18</biblScope>
                  <biblScope type="issue">1</biblScope>
                  <date>1996</date>
                  <biblScope type="pp">3&#x2013;10</biblScope>
                </imprint>
              </monogr>
              <ptr target="http://dx.doi.org/10.1016/0920-5489(95)00035-6"/>
              <note>Technical article summarizing how SGML was used in TEI P3 to implement modularity, customization,
                and hyperlinking. Of interest in the history of ODD.</note>
            </biblStruct>
            <biblStruct xml:id="BurnardRahtz2004">
              <analytic>
                <author>
                  <forename>Lou</forename>
                  <surname>Burnard</surname>
                </author>
                <author>
                  <forename>Sebastian</forename>
                  <surname>Rahtz</surname>
                </author>
                <title level="m">RelaxNG with Son of ODD</title>
              </analytic>
              <monogr>
                <title level="m">Proceedings of Extreme Markup Languages 2004</title>
                <imprint>
                  <date>2004</date>
                </imprint>
              </monogr>
              <ref target="http://www.mulberrytech.com/Extreme/Proceedings/html/2004/Burnard01/EML2004Burnard01.pdf"/>
              <note>Technical description of the new ODD system developed for TEI P5.</note>
            </biblStruct>
            <biblStruct xml:id="Burnard2000">
              <analytic>
                <author>
                  <forename>Lou</forename>
                  <surname>Burnard</surname>
                </author>
                <title level="m">Text Encoding for Interchange: A New Consortium</title>
                <ptr target="http://www.ariadne.ac.uk/issue24/tei/"/>
              </analytic>
              <monogr>
                <title level="j">Ariadne, Issue 24</title>
                <imprint>
                  <date>June 2000</date>
                </imprint>
              </monogr>
              <note>Press release describing the relaunch of the TEI as a membership Consortium.</note>
            </biblStruct>
            <biblStruct xml:id="Burnard2001">
              <analytic>
                <author>
                  <forename>Lou</forename>
                  <surname>Burnard</surname>
                </author>
                <title level="a">On the Hermeneutic Implications of Text Encoding</title>
                <ptr target="http://users.ox.ac.uk/~lou/wip/herman.htm"/>
              </analytic>
              <monogr>
                <editor>
                  <forename>Domenico</forename>
                  <surname>Fiormonte</surname>
                </editor>
                <editor>
                  <forename>Jonathan</forename>
                  <surname>Usher</surname>
                </editor>
                <title level="m">New Media and the Humanities: Research and Applications</title>
                <imprint>
                  <pubPlace>Oxford</pubPlace>
                  <publisher>Humanities Computing Unit</publisher>
                  <date>2001</date>
                  <biblScope type="pp">31&#x2013;38</biblScope>
                </imprint>
              </monogr>
              <!-- note>last accessed on August 12, 2007</note-->
              <note>Brief article stressing the interpretive nature of markup and placing it within an ancient scholarly
                tradition.</note>
            </biblStruct>
            <biblStruct xml:id="Burnard2013">
              <analytic>
                <author>
                  <forename>Lou</forename>
                  <surname>Burnard</surname>
                </author>
                <title level="a">The Evolution of the Text Encoding Initiative: From Research Project to Research
                  Infrastructure </title>
              </analytic>
              <monogr>
                <title level="j">Journal of the Text Encoding Initiative</title>
                <imprint>
                  <biblScope type="issue">5</biblScope>
                  <date>2013</date>
                </imprint>
              </monogr>
              <ptr target="http://jtei.revues.org/811"/>
              <note>Historical review of the development of the TEI to date.</note>
            </biblStruct>
            <biblStruct xml:id="Coombsetal1987">
              <analytic>
                <author>
                  <forename>James</forename>
                  <forename>H.</forename>
                  <surname>Coombs</surname>
                </author>
                <author>
                  <forename>Allen</forename>
                  <surname>Renear</surname>
                </author>
                <author>
                  <forename>Steven</forename>
                  <forename>J.</forename>
                  <surname>DeRose</surname>
                </author>
                <title level="a">Markup Systems and The Future of Scholarly Text Processing</title>
                <ref target="http://xml.coverpages.org/coombs-hallgren.html"/>
                <ref target="http://xml.coverpages.org/coombs.html"/>
              </analytic>
              <monogr>
                <title level="j">Communications of the ACM</title>
                <imprint>
                  <biblScope type="vol">30</biblScope>
                  <biblScope type="issue">11</biblScope>
                  <date>1987</date>
                  <biblScope type="pp">933&#x2013;947</biblScope>
                </imprint>
              </monogr>
              <ptr target="http://doi.acm.org/10.1145/32206.32209"/>
              <!-- note>last accessed August 12, 2007</note-->
              <!--idno type="doi">10.1145/32206.32209</idno-->
              <!-- note>last accessed August 12, 2007</note-->
              <!-- note>last accessed August 12, 2007</note-->
              <!--note>Reprinted with new commentary in <ptr target="#Landow1993a"/>, pp
					85–118</note-->
              <note>Classic and influential polemic arguing for descriptive rather than procedural markup as a scholarly
                activity.</note>
            </biblStruct>
            <biblStruct xml:id="DeRose1997a">
              <analytic>
                <author>
                  <forename>Steven</forename>
                  <forename>J.</forename>
                  <surname>DeRose</surname>
                </author>
                <author>
                  <forename>David</forename>
                  <forename>G.</forename>
                  <surname>Durand</surname>
                </author>
                <author>
                  <forename>Elli</forename>
                  <surname>Mylonas</surname>
                </author>
                <author>
                  <forename>Allen</forename>
                  <forename>H.</forename>
                  <surname>Renear</surname>
                </author>
                <title level="a">What is Text, Really?</title>
              </analytic>
              <monogr>
                <title level="j">Journal of Computer Documentation</title>
                <imprint>
                  <biblScope type="vol">21</biblScope>
                  <biblScope type="issue">3</biblScope>
                  <date>1997</date>
                  <biblScope type="pp">1&#x2013;24</biblScope>
                </imprint>
              </monogr>
              <ptr target="http://doi.acm.org/10.1145/264842.264843"/>
              <!--idno type="doi">10.1145/264842.264843</idno-->
              <note>Classic statement of the <soCalled>OHCO</soCalled> hypothesis according to which text is
                fundamentally an "Ordered Hierarchy of Content".</note>
            </biblStruct>
            <biblStruct xml:id="HolmesRomary2010">
              <analytic>
                <author>
                  <forename>Martin</forename>
                  <surname>Holmes</surname>
                </author>
                <author>
                  <forename>Laurent</forename>
                  <surname>Romary</surname>
                </author>
                <title type="main" level="a">Encoding models for scholarly literature</title>
              </analytic>
              <monogr>
                <title level="m" type="main">Publishing and digital libraries: Legal and organizational issues</title>
                <imprint>
                  <publisher>IGI Global</publisher>
                  <biblScope type="pp">88-110</biblScope>
                </imprint>
              </monogr>
              <!--idno type="doi">10.4018/978-1-60960-031-0</idno>
				<idno type="HALid">http://hal.archives-ouvertes.fr/hal-00390966</idno-->
              <ptr target="http://hal.archives-ouvertes.fr/hal-00390966/PDF/romary_chap_iglezakis_book.pdf"/>
              <note>Discusses use of TEI for the encoding and management of academic publications.</note>
            </biblStruct>
            <biblStruct xml:id="Ide1995b">
              <monogr>
                <editor>
                  <forename>Nancy</forename>
                  <surname>Ide</surname>
                </editor>
                <editor>
                  <forename>Jean</forename>
                  <surname>Veronis</surname>
                </editor>
                <title level="m">The Text Encoding Initiative: Background and Contexts</title>
                <imprint>
                  <pubPlace>Dordrecht</pubPlace>
                  <pubPlace>Boston</pubPlace>
                  <publisher>Kluwer Academic Publisher</publisher>
                  <date>1995</date>
                </imprint>
              </monogr>
              <note>Essential collection of 17 articles originally published as a double issue of Computers and the
                Humanities in 1994. Major TEI contributors of the first generation provide overviews of the TEI approach
                to encoding specific text types, complemented by classic articles on TEI objectives and design, and on
                SGML. </note>
            </biblStruct>
            <biblStruct xml:id="IdeRomary">
              <analytic>
                <author><forename>Nancy</forename><surname>Ide</surname></author>
                <author><forename>Laurent</forename><surname>Romary</surname>
                </author>
                <title type="main" level="a">A Registry of Standard Data Categories for Linguistic Annotation</title>
              </analytic>
              <monogr>
                <title>Proceedings of the 4th International Conference on Language Resources and Evaluation -
                  LREC'04</title>
                <imprint>
                  <pubPlace>Lisbon, Portugal</pubPlace>
                  <date>2004</date>
                  <biblScope type="pp">135-138</biblScope>
                </imprint>
              </monogr>
              <ref type="HALid">http://hal.inria.fr/inria-00099858</ref>
              <note>Describes the development of a Data Category Registry (DCR) component for the Linguistic Annotation
                Framework; an ISO standard of major importance in the encoding of linguistic analysis. </note>
            </biblStruct>
            <biblStruct xml:id="Mertz2003">
              <monogr>
                <author>
                  <forename>David</forename>
                  <surname>Mertz</surname>
                </author>
                <title level="m" type="main">XML Matters: TEI &#x2014; the Text Encoding Initiative</title>
                <title level="m" type="sub"> An XML Dialect for Archival and Complex Documents</title>
                <imprint>
                  <date>2003</date>
                </imprint>
              </monogr>
              <ref target="http://www-106.ibm.com/developerworks/xml/library/x-matters30.html"/>
              <!-- note>last accessed January 27, 2005</note-->
              <note>Interesting perspective on TEI-XML as seen from outside the scholarly community.</note>
            </biblStruct>
            <biblStruct xml:id="MylonasandRenear1999">
              <analytic>
                <author>
                  <forename>Elli</forename>
                  <surname>Mylonas</surname>
                </author>
                <author>
                  <forename>Allen</forename>
                  <surname>Renear</surname>
                </author>
                <title level="a">The Text Encoding Initiative at 10: Not Just an Interchange Format Anymore &#x2014; But a New
                  Research Community</title>
              </analytic>
              <monogr>
                <title level="j">Computers and the Humanities</title>
                <imprint>
                  <biblScope type="vol">33</biblScope>
                  <biblScope type="issue">1-2</biblScope>
                  <date>1999</date>
                </imprint>
              </monogr>
              <idno type="DOI">http://dx.doi.org/10.1023/A:1001832310939</idno>
              <note>Introduction to a retrospective collection of 12 selected papers produced for the TEI 10th
                Anniversary Conference, held at Brown University in November 1997. </note>
            </biblStruct>
            <biblStruct xml:id="Schmidt2011">
              <analytic>
                <author>
                  <forename>Thomas</forename>
                  <surname>Schmidt</surname>
                </author>
                <title level="a">A TEI-based Approach to Standardising Spoken Language Transcription</title>
              </analytic>
              <monogr>
                <title level="j">Journal of the Text Encoding Initiative</title>
                <imprint>
                  <biblScope type="issue">1</biblScope>
                  <date>2011</date>
                </imprint>
              </monogr>
              <ptr target="http://jtei.revues.org/142"/>
              <note>Surveys existing transcription schemes for spoken language and the feasibility of using TEI as an
                interlingua amongst them.</note>
            </biblStruct>
            <biblStruct xml:id="SperbergMcQueen1991">
              <analytic>
                <author>
                  <forename>C.</forename>
                  <forename>Michael</forename>
                  <surname>Sperberg-McQueen</surname>
                </author>
                <title level="a">Text in the Electronic Age: Textual Study and Text Encoding, with Examples from
                  Medieval Texts</title>
              </analytic>
              <monogr>
                <title level="j">Literary &amp; Linguistic Computing</title>
                <imprint>
                  <biblScope type="vol">6</biblScope>
                  <biblScope type="issue">1</biblScope>
                  <date>1991</date>
                  <biblScope type="pp">34-46</biblScope>
                </imprint>
              </monogr>
              <ptr target="http://dx.doi.org/10.1093/llc/6.1.34"/>
              <!-- note>last accessed August 12, 2007</note-->
              <!--idno type="doi">10.1093/llc/6.1.34</idno-->
              <note>Classic statement of markup theory as applied to the editing of primary sources.</note>
            </biblStruct>
            <biblStruct xml:id="Unsworthetaleds2004">
              <monogr>
                <editor>
                  <forename>John</forename>
                  <surname>Unsworth</surname>
                </editor>
                <editor>
                  <forename>Katherine</forename>
                  <surname>O'Brien</surname>
                  <surname>O'Keeffe</surname>
                </editor>
                <editor>
                  <forename>Lou</forename>
                  <surname>Burnard</surname>
                </editor>
                <title level="m">Electronic Textual Editing</title>
                <imprint>
                  <pubPlace>New York</pubPlace>
                  <publisher>Modern Languages Association</publisher>
                  <date>2006</date>
                </imprint>
              </monogr>
              <note>Collection of articles by 24 leading practioners covering all aspects of electronic textual editing
                within the TEI paradigm. An early online version is available at <ptr target="http://www.tei-c.org/Activities/ETE/"/>. </note>
            </biblStruct>
            <biblStruct xml:id="WitternEtAl2009">
              <analytic>
                <author>
                  <forename>Christian</forename>
                  <surname>Wittern</surname>
                </author>
                <author>
                  <forename>Conal</forename>
                  <surname>Tuohy</surname>
                </author>
                <author>
                  <forename>Arianna</forename><surname>Ciula</surname>. </author>
                <title level="a">The making of TEI P5</title>
              </analytic>
              <monogr>
                <title level="j">Literary and Linguistic Computing</title>
                <imprint>
                  <biblScope type="vol">24</biblScope>
                  <biblScope type="issue">3</biblScope>
                  <date>2009</date>
                  <biblScope type="pp">281-96</biblScope>
                </imprint>
              </monogr>
              <ptr target="http://dx.doi.org/10.1093/llc/fqp017"/>
              <note>Detailed report on the editorial work leading up to the first edition of TEI P5.</note>
            </biblStruct>
          </listBibl>
        </div>
</div>
      </body>
  </text>
</TEI>
